{
	"results": [
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781492077206/",
			"archive_id": "9781492077206",
			"ourn": "urn:orm:book:9781492077206",
			"isbn": "9781492077213",
			"last_modified_time": "2022-05-12T18:01:10.027Z",
			"issued": "2021-03-02T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Jon Bodner"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Learning Go",
			"description": "<span><div><p>Go is rapidly becoming the preferred language for building web services. While there are plenty of tutorials available that teach Go's syntax to developers with experience in other programming languages, tutorials aren't enough. They don't teach Go's idioms, so developers end up recreating patterns that don't make sense in a Go context. This practical guide provides the essential background you need to write clear and idiomatic Go.</p><p>No matter your level of experience, you'll learn how to think like a Go developer. Author Jon Bodner introduces the design patterns experienced Go developers have adopted and explores the rationale for using them. You'll also get a preview of Go's upcoming generics support and how it fits into the language.</p><ul><li>Learn how to write idiomatic code in Go and design a Go project</li><li>Understand the reasons for the design decisions in Go</li><li>Set up a Go development environment for a solo developer or team</li><li>Learn how and when to use reflection, unsafe, and cgo</li><li>Discover how Go's features allow the language to run efficiently</li><li>Know which Go features you should use sparingly or not at all</li></ul></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781492077206/",
			"web_url": "/library/view/learning-go/9781492077206/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 469,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-05-12T18:06:38.114Z",
			"average_rating": 4911,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 28,
			"popularity": 999943607,
			"report_score": 137500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781492077206/",
			"date_added": "2022-05-12T18:00:37.329Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780134190570/",
			"archive_id": "9780134190570",
			"ourn": "urn:orm:book:9780134190570",
			"isbn": "9780134190570",
			"last_modified_time": "2021-07-09T16:09:25.592Z",
			"issued": "2015-10-26T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Alan A. A. Donovan",
				"Brian W. Kernighan"
			],
			"publishers": [
				"Addison-Wesley Professional"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "The Go Programming Language",
			"description": "<span><p><i><b>The Go Programming Language</b></i> is the authoritative resource for any programmer who wants to learn Go. It shows how to write clear and idiomatic Go to solve real-world problems. The book does not assume prior knowledge of Go nor experience with any specific language, so you'll find it accessible whether you're most comfortable with JavaScript, Ruby, Python, Java, or C++.</p><p> </p><ul><li><div>The first chapter is a tutorial on the basic concepts of Go, introduced through programs for file I/O and text processing, simple graphics, and web clients and servers.</div></li><li><div>Early chapters cover the structural elements of Go programs: syntax, control flow, data types, and the organization of a program into packages, files, and functions. The examples illustrate many packages from the standard library and show how to create new ones of your own. Later chapters explain the package mechanism in more detail, and how to build, test, and maintain projects using the go tool.</div></li><li><div>The chapters on methods and interfaces introduce Go's unconventional approach to object-oriented programming, in which methods can be declared on any type and interfaces are implicitly satisfied. They explain the key principles of encapsulation, composition, and substitutability using realistic examples.</div></li><li><div>Two chapters on concurrency present in-depth approaches to this increasingly important topic. The first, which covers the basic mechanisms of goroutines and channels, illustrates the style known as communicating sequential processes for which Go is renowned. The second covers more traditional aspects of concurrency with shared variables. These chapters provide a solid foundation for programmers encountering concurrency for the first time.</div></li><li><div>The final two chapters explore lower-level features of Go. One covers the art of metaprogramming using reflection. The other shows how to use the unsafe package to step outside the type system for special situations, and how to use the cgo tool to create Go bindings for C libraries.</div></li></ul><p>The book features hundreds of interesting and practical examples of well-written Go code that cover the whole language, its most important packages, and a wide range of applications. Each chapter has exercises to test your understanding and explore extensions and alternatives. Source code is freely available for download from <a href=\"http://gopl.io/\">http://gopl.io/</a> and may be conveniently fetched, built, and installed using the go get command.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780134190570/",
			"web_url": "/library/view/the-go-programming/9780134190570/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 769,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T22:54:45.070Z",
			"average_rating": 4755,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 49,
			"popularity": 998295523,
			"report_score": 233000,
			"cover_url": "https://learning.oreilly.com/library/cover/9780134190570/",
			"date_added": "2019-08-30T17:04:15.489Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781492076322/",
			"archive_id": "9781492076322",
			"ourn": "urn:orm:book:9781492076322",
			"isbn": "9781492076339",
			"last_modified_time": "2022-04-18T14:11:15.850Z",
			"issued": "2021-04-20T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Matthew A. Titmus"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Cloud Native Go",
			"description": "<span><div><p>What do Docker, Kubernetes, and Prometheus have in common? All of these cloud native technologies are written in the Go programming language. This practical book shows you how to use Go's strengths to develop cloud native services that are scalable and resilient, even in an unpredictable environment. You'll explore the composition and construction of these applications, from lower-level features of Go to mid-level design patterns to high-level architectural considerations.</p><p>Each chapter builds on the lessons of the last, walking intermediate to advanced developers through Go to construct a simple but fully featured distributed key-value store. You'll learn best practices for adopting Go as your development language for solving cloud native management and deployment issues.</p><ul><li>Learn how cloud native applications differ from other software architectures</li><li>Understand how Go can solve the challenges of designing scalable distributed services</li><li>Leverage Go's lower-level features, such as channels and goroutines, to implement a reliable cloud native service</li><li>Explore what \"service reliability\" is and what it has to do with cloud native</li><li>Apply a variety of patterns, abstractions, and tooling to build and manage complex distributed systems</li></ul></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781492076322/",
			"web_url": "/library/view/cloud-native-go/9781492076322/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 561,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-04-18T14:22:46.308Z",
			"average_rating": 4700,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 15,
			"popularity": 997381095,
			"report_score": 70500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781492076322/",
			"date_added": "2022-04-18T14:10:32.856Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781484273555/",
			"archive_id": "9781484273555",
			"ourn": "urn:orm:book:9781484273555",
			"isbn": "9781484273555",
			"last_modified_time": "2022-05-23T10:00:19.386Z",
			"issued": "2022-01-12T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Adam Freeman"
			],
			"publishers": [
				"Apress"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Pro Go: The Complete Guide to Programming Reliable and Efficient Software Using Golang",
			"description": "<span><p>Best-selling author Adam Freeman explains how to get the most from Go, starting from the basics and building up to the most advanced and sophisticated features. You will learn how Go builds on a simple and consistent type system to create a comprehensive and productive development experience that produces fast and robust applications that run across platforms.</p><p>Go, also known as Golang, is the concise and efficient programming language designed by Google for creating high-performance, cross-platform applications. Go combines strong static types with simple syntax and a comprehensive standard library to increase programmer productivity, while still supporting features such as concurrent/parallel programming.</p><p>Each topic is covered in a clear, concise, no-nonsense approach that is packed with the details you need to learn to be truly effective. Chapters include common problems and how to avoid them.</p><p><b>What You Will Learn</b></p><ul><li>Gain      a solid understanding of the Go language and tools</li><li>Gain      in-depth knowledge of the Go standard library</li><li>Use      Go for concurrent/parallel tasks</li><li>Use      Go for client- and server-side development </li></ul><p> <b>Who This Book Is For</b></p><p></p>\n\nExperienced developers who want to use Go to create applications<p></p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781484273555/",
			"web_url": "/library/view/pro-go-the/9781484273555/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 1134,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-05-23T10:01:26.019Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 996298933,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781484273555/",
			"date_added": "2022-01-14T09:20:55.632Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781491941294/",
			"archive_id": "9781491941294",
			"ourn": "urn:orm:book:9781491941294",
			"isbn": "9781491941300",
			"last_modified_time": "2022-02-09T04:41:11.028Z",
			"issued": "2017-07-19T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Katherine Cox-Buday"
			],
			"publishers": [
				"O'Reilly Media"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Concurrency in Go",
			"description": "<span><div><p>Concurrency can be notoriously difficult to get right, but fortunately, the Go open source programming language makes working with concurrency tractable and even easy. If you’re a developer familiar with Go, this practical book demonstrates best practices and patterns to help you incorporate concurrency into your systems.</p><p>Author Katherine Cox-Buday takes you step-by-step through the process. You’ll understand how Go chooses to model concurrency, what issues arise from this model, and how you can compose primitives within this model to solve problems. Learn the skills and tooling you need to confidently write and implement concurrent systems of any size.</p><ul><li>Understand how Go addresses fundamental problems that make concurrency difficult to do correctly</li><li>Learn the key differences between concurrency and parallelism</li><li>Dig into the syntax of Go’s memory synchronization primitives</li><li>Form patterns with these primitives to write maintainable concurrent code</li><li>Compose patterns into a series of practices that enable you to write large, distributed systems that scale</li><li>Learn the sophistication behind goroutines and how Go’s runtime stitches everything together</li></ul></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781491941294/",
			"web_url": "/library/view/concurrency-in-go/9781491941294/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 292,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-02-09T04:43:07.310Z",
			"average_rating": 4887,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 31,
			"popularity": 996046129,
			"report_score": 151500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781491941294/",
			"date_added": "2019-08-30T09:56:35.921Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781491969540/",
			"archive_id": "9781491969540",
			"ourn": "urn:orm:book:9781491969540",
			"isbn": "9781491969557",
			"last_modified_time": "2022-03-07T18:27:04.282Z",
			"issued": "2019-04-19T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Jay McGavren"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Head First Go",
			"description": "<span><div><p><b>What will you learn from this book?</b></p><p>Go makes it easy to build software that’s simple, reliable, and efficient. Andthis book makes it easy for programmers like you to get started. Googledesigned Go for high-performance networking and multiprocessing, but—like Python and JavaScript—the language is easy to read and use. With thispractical hands-on guide, you’ll learn how to write Go code using clearexamples that demonstrate the language in action. Best of all, you’ll understandthe conventions and techniques that employers want entry-level Godevelopers to know.</p><p><b>Why does this book look so different?</b></p><p>Based on the latest research in cognitive science and learning theory, HeadFirst Go uses a visually rich format to engage your mind rather than a textheavyapproach that puts you to sleep. Why waste your time struggling withnew concepts? This multisensory learning experience is designed for theway your brain really works.</p></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781491969540/",
			"web_url": "/library/view/head-first-go/9781491969540/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 749,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-03-07T18:28:30.444Z",
			"average_rating": 4605,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 38,
			"popularity": 996004001,
			"report_score": 175000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781491969540/",
			"date_added": "2022-02-11T15:26:00.770Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781801079310/",
			"archive_id": "9781801079310",
			"ourn": "urn:orm:book:9781801079310",
			"isbn": "9781801079310",
			"last_modified_time": "2022-04-21T14:00:55.057Z",
			"issued": "2021-08-31T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mihalis Tsoukalos"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Mastering Go - Third Edition",
			"description": "<span><p><b>Master key features of Go, including advanced concepts like concurrency and working with JSON, to create and optimize real-world services, network servers, and clients</b></p><h4>Key Features</h4><ul><li>This third edition of the bestselling guide to advanced Go programming has been overhauled and expanded to cover RESTful servers, the WebSocket protocol, and Go generics</li><li>Use real-world exercises to build high-performance network servers and powerful command line utilities</li><li>Packed with practical examples and utilities to apply to your own development work and administrative tasks</li><li>Get clear explanations about Go nuances and features to simplify Go development</li></ul><h4>Book Description</h4><p>Mastering Go is the essential guide to putting Go to work on real production systems. This freshly updated third edition includes topics like creating RESTful servers and clients, understanding Go generics, and developing gRPC servers and clients.</p><p>Mastering Go was written for programmers who want to explore the capabilities of Go in practice. As you work your way through the chapters, you'll gain confidence and a deep understanding of advanced Go concepts, including concurrency and the operation of the Go Garbage Collector, using Go with Docker, writing powerful command-line utilities, working with JavaScript Object Notation (JSON) data, and interacting with databases. You'll also improve your understanding of Go internals to optimize Go code and use data types and data structures in new and unexpected ways.</p><p>This essential Go programming book will also take you through the nuances and idioms of Go with exercises and resources to fully embed your newly acquired knowledge. </p><p>With the help of Mastering Go, you'll become an expert Go programmer by building Go systems and implementing advanced Go techniques in your projects.</p><h4>What you will learn</h4><ul><li>Use Go in production</li><li>Write reliable, high-performance concurrent code</li><li>Manipulate data structures including slices, arrays, maps, and pointers</li><li>Develop reusable packages with reflection and interfaces</li><li>Become familiar with generics for effective Go programming</li><li>Create concurrent RESTful servers, and build gRPC clients and servers</li><li>Define Go structures for working with JSON data</li></ul><h4>Who this book is for</h4><p>You'll need to know the basics of Go before you get started with this book, but beyond that, anyone can sink their teeth into it. It's written primarily for Go programmers who have a bit of experience with the language and want to become expert practitioners.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781801079310/",
			"web_url": "/library/view/mastering-go/9781801079310/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 711,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-04-21T14:01:27.705Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 994236246,
			"report_score": 5000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781801079310/",
			"date_added": "2021-09-01T16:35:31.541Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781680509311/",
			"archive_id": "9781680509311",
			"ourn": "urn:orm:book:9781680509311",
			"isbn": "9781680509328",
			"last_modified_time": "2022-02-09T11:58:44.482Z",
			"issued": "2021-12-08T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Ricardo Gerardi"
			],
			"publishers": [
				"Pragmatic Bookshelf"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Powerful Command-Line Applications in Go",
			"description": "<span><div><p>Whether you want to automate tasks, analyze data, parse logs, talk to network services, or address other systems requirements, writing your own command-line tool may be the fastest - and perhaps the most fun - way to do it. The Go programming language is a great choice for developing tools that are fast, reliable, and cross-platform. Create command-line tools that work with files, connect to services, and even manage external processes, all while using tests and benchmarks to ensure your programs are fast and correct.</p><p>When you want to develop cross platform command-line tools that are fast and reliable, use Go, a modern programming language that combines the reliability of compiled languages with the ease of use and flexibility of dynamic typed languages. Work through practical examples to develop elegant and efficient tools by applying Go's rich standard library, its built in support for concurrency, and its expressive syntax. Use Go's integrated testing capabilities to automatically test your tools, ensuring they work reliably even across code refactoring.</p><p>Develop CLI tools that interact with your users by using common input/output patterns, including environment variables and flags. Handle files to read or persist data, and manipulate paths consistently in cross-platform scenarios. Control processes and handle signals, and use a benchmark driven approach and Go's concurrency primitives to create tools that perform well. Use powerful external libraries such as Cobra to create modern and flexible tools that handle subcommands, and develop tools that interact with databases, APIs, and network services. Finally, leverage what you learned by tackling additional challenges at the end of each chapter.</p><p><b>What You Need:</b></p><p>Go 1.8 or higher, an internet connection to download the example files and additional libraries, and a text editor to write your programs.</p></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781680509311/",
			"web_url": "/library/view/powerful-command-line-applications/9781680509311/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 592,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-02-09T12:01:07.891Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 993395561,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781680509311/",
			"date_added": "2022-02-04T17:35:40.803Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781119773818/",
			"archive_id": "9781119773818",
			"ourn": "urn:orm:book:9781119773818",
			"isbn": "9781119773818",
			"last_modified_time": "2022-01-24T23:32:22.758Z",
			"issued": "2021-12-21T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Amit Saha"
			],
			"publishers": [
				"Wiley"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Practical Go",
			"description": "<span><b>Step-by-step instruction on writing your first production-ready servers with Golang</b><p>Google's Go language, otherwise known as Golang, is a fast, simple, and reliable language that is rapidly becoming a highly popular choice for developers of all kinds. With particular utility in cloud-native environments, Golang is being adopted in major projects like Docker and Ethereum thanks to its user-friendly features, like concurrency and easy deployment. </p><p>In <i>Practical Golang: Building Scalable Network and Non-Network Applications,</i> expert coder and devops engineer Amit Saha delivers a step-by-step guide to writing production-ready HTTP 1.1, HTTP2, RPC, and TCP/UDP servers. Walking you through the entire process of learning this already straightforward language, from your first application to your first deployed server, the authors rely solely on the most popular open-source projects to ensure you can apply the book's advice in any cloud environment. </p><p>In this book, you'll get: </p><ul><li>Fulsome descriptions of best practices on load balancing, scaling, and failure handling</li><li>Stepwise guidance on writing an HTTP service from scratch using only Golang's standard library</li><li>Easy tutorials on implementing RPC and HTTP interfaces for RPC services </li><li>Straightforward instructions on using SQL databases</li></ul><p>Perfect for software developers, devops engineers, and other programming professionals, <i>Practical Golang</i> is also an indispensable resource for anyone who wants to go beyond the basics of Golang and deploy robust and practical servers.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781119773818/",
			"web_url": "/library/view/practical-go/9781119773818/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 501,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-01-24T23:36:47.777Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 991324909,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781119773818/",
			"date_added": "2022-01-24T23:31:43.120Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781098128890/",
			"archive_id": "9781098128890",
			"ourn": "urn:orm:book:9781098128890",
			"isbn": "9781718500884",
			"last_modified_time": "2021-03-16T18:06:17.572Z",
			"issued": "2021-03-30T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Adam Woodbeck"
			],
			"publishers": [
				"No Starch Press"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Network Programming with Go",
			"description": "<span><div><p>Go combines the best parts of many other programming languages. It’s fast, scalable, and designed for high-performance networking and multiprocessing—in other words, it’s perfect for network programming.</p><p><i>Network Programming with Go</i> is for developers ready to start leveraging Go’s ease of use for writing secure, readable, production-ready network code. Early chapters establish a foundation of networking and traffic-routing know-how upon which the rest of the book builds. You’ll put that knowledge to use as author Adam Woodbeck guides you through writing programs that communicate using TCP, UDP, Unix sockets, and other features that ensure reliable data transmission. As you progress, you’ll explore higher-level network protocols like HTTP and HTTP/2, then build applications that securely interact with servers, clients, and APIs over a network using TLS.</p><p>In addition, Woodbeck shows you how to create a simple messaging protocol, develop tools for monitoring network traffic, craft a custom web server, and implement best practices for interacting with cloud providers using their SDKs. Along the way, you’ll learn:</p><p>•IP basics for writing effective network programs, such as IPv4 and IPv6 multicasting, ports, and network address translation<br/>•How to use handlers, middleware, and multiplexers to build capable HTTP-based applications with minimal code<br/>•The OSI and TCP/IP models for layered data architectures<br/>•Methods for reading data from/writing data to a network connection, like the type-length-value encoding scheme<br/>•Tools for incorporating authentication and encryption into your applications using TLS, like mutual authentication<br/>•How to serialize data for storage or transmission in Go-friendly formats like JSON, Gob, XML, and protocol buffers<br/>•How to Leverage Go’s code generation support to efficiently communicate with gRPC-based network services</p><p>So get ready to take advantage of Go’s built-in concurrency, rapid compiling, and rich standard library. Because when it comes to writing robust network programs, it’s Go time.</p></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781098128890/",
			"web_url": "/library/view/network-programming-with/9781098128890/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 510,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T01:06:03.652Z",
			"average_rating": 4667,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 990766015,
			"report_score": 14000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781098128890/",
			"date_added": "2021-03-16T18:05:34.855Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781098105709/",
			"archive_id": "9781098105709",
			"ourn": "urn:orm:book:9781098105709",
			"isbn": "9781098105648",
			"last_modified_time": "2022-03-01T20:00:51.470Z",
			"issued": "2022-12-25T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Bartlomiej Plotka"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Efficient Go",
			"description": "<span><div><p>Software engineers today typically put performance optimizations low on the list of development priorities. But despite significant technological advancements and lower-priced hardware, software efficiency still matters. With this book, Go programmers will learn how to approach performance topics for applications written in this open source language.</p><p>How and when should you apply performance efficiency optimization without wasting your time? Author Bartlomiej Plotka provides the tools and knowledge you need to make your system faster using fewer resources. Once you learn how to address performance in your Go applications, you'll be able to bring small but effective habits to your programming and development cycle.</p><p>This book shows you how to:</p><ul><li>Continuously monitor for performance and efficiency regressions</li><li>Find the root cause of performance bottlenecks using metrics, logging, tracing, and profiling</li><li>Use tools like pprof, go test, benchstat and k6.io to create reliable micro- and macro-benchmarks</li><li>Improve and optimize your code to meet your goals without sacrificing simplicity and readability</li><li>Make data-driven decisions by prioritizing changes that make a difference</li><li>Introduce basic \"performance hygiene\" in day-to-day Go programming and testing</li></ul></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781098105709/",
			"web_url": "/library/view/efficient-go/9781098105709/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 253,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-03-01T20:02:50.951Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 989398055,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781098105709/",
			"date_added": "2022-03-01T20:00:27.283Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781838554491/",
			"archive_id": "9781838554491",
			"ourn": "urn:orm:book:9781838554491",
			"isbn": "9781838554491",
			"last_modified_time": "2021-07-12T11:31:33.504Z",
			"issued": "2020-01-24T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Achilleas Anagnostopoulos"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Hands-On Software Engineering with Golang",
			"description": "<span><p><b>Explore software engineering methodologies, techniques, and best practices in Go programming to build easy-to-maintain software that can effortlessly scale on demand</b></p><h4>Key Features</h4><ul><li>Apply best practices to produce lean, testable, and maintainable Go code to avoid accumulating technical debt\n</li><li>Explore Go's built-in support for concurrency and message passing to build high-performance applications\n</li><li>Scale your Go programs across machines and manage their life cycle using Kubernetes</li></ul><h4>Book Description</h4><p>Over the last few years, Go has become one of the favorite languages for building scalable and distributed systems. Its opinionated design and built-in concurrency features make it easy for engineers to author code that efficiently utilizes all available CPU cores.\n</p><p>This Golang book distills industry best practices for writing lean Go code that is easy to test and maintain, and helps you to explore its practical implementation by creating a multi-tier application called Links 'R' Us from scratch. You'll be guided through all the steps involved in designing, implementing, testing, deploying, and scaling an application. Starting with a monolithic architecture, you'll iteratively transform the project into a service-oriented architecture (SOA) that supports the efficient out-of-core processing of large link graphs. You'll learn about various cutting-edge and advanced software engineering techniques such as building extensible data processing pipelines, designing APIs using gRPC, and running distributed graph processing algorithms at scale. Finally, you'll learn how to compile and package your Go services using Docker and automate their deployment to a Kubernetes cluster.\n</p><p>By the end of this book, you'll know how to think like a professional software developer or engineer and write lean and efficient Go code.\n</p><h4>What you will learn</h4><ul><li>Understand different stages of the software development life cycle and the role of a software engineer\n</li><li>Create APIs using gRPC and leverage the middleware offered by the gRPC ecosystem\n</li><li>Discover various approaches to managing package dependencies for your projects\n</li><li>Build an end-to-end project from scratch and explore different strategies for scaling it\n</li><li>Develop a graph processing system and extend it to run in a distributed manner\n</li><li>Deploy Go services on Kubernetes and monitor their health using Prometheus</li></ul><h4>Who this book is for</h4><p>This Golang programming book is for developers and software engineers looking to use Go to design and build scalable distributed systems effectively. Knowledge of Go programming and basic networking principles is required.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781838554491/",
			"web_url": "/library/view/hands-on-software-engineering/9781838554491/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 873,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T07:22:51.071Z",
			"average_rating": 4643,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 7,
			"popularity": 983820235,
			"report_score": 32500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781838554491/",
			"date_added": "2020-02-05T22:07:28.784Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781098122645/",
			"archive_id": "9781098122645",
			"ourn": "urn:orm:book:9781098122645",
			"isbn": "9781593278656",
			"last_modified_time": "2020-11-06T17:07:23.513Z",
			"issued": "2020-01-21T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Tom Steele",
				"Chris Patten",
				"Dan Kottmann"
			],
			"publishers": [
				"No Starch Press"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Black Hat Go",
			"description": "<span><div><p><i>Black Hat Go</i> explores the darker side of Go, the popular programming language revered by hackers for its simplicity, efficiency, and reliability. It provides an arsenal of practical tactics from the perspective of security practitioners and hackers to help you test your systems, build and automate tools to fit your needs, and improve your offensive security skillset, all using the power of Go.</p><p>You’ll begin your journey with a basic overview of Go’s syntax and philosophy and then start to explore examples that you can leverage for tool development, including common network protocols like HTTP, DNS, and SMB. You’ll then dig into various tactics and problems that penetration testers encounter, addressing things like data pilfering, packet sniffing, and exploit development. You’ll create dynamic, pluggable tools before diving into cryptography, attacking Microsoft Windows, and implementing steganography.</p><p>You'll learn how to:</p><p>•Make performant tools that can be used for your own security projects<br/><br/>•Create usable tools that interact with remote APIs<br/><br/>•Scrape arbitrary HTML data<br/><br/>•Use Go’s standard package, net/http, for building HTTP servers<br/><br/>•Write your own DNS server and proxy<br/><br/>•Use DNS tunneling to establish a C2 channel out of a restrictive network<br/><br/>•Create a vulnerability fuzzer to discover an application’s security weaknesses<br/><br/>•Use plug-ins and extensions to future-proof products<br/><br/>•Use plug-ins and extensions to future-proof products<br/><br/>•Build an RC2 symmetric-key brute-forcer<br/><br/>•Implant data within a Portable Network Graphics (PNG) image</p><p>Are you ready to add to your arsenal of security tools? Then let’s Go!</p></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781098122645/",
			"web_url": "/library/view/black-hat-go/9781098122645/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 510,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T11:04:02.150Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 4,
			"popularity": 982531124,
			"report_score": 20000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781098122645/",
			"date_added": "2020-11-06T16:36:27.765Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781617291784/",
			"archive_id": "9781617291784",
			"ourn": "urn:orm:book:9781617291784",
			"isbn": "9781617291784",
			"last_modified_time": "2021-05-11T18:57:00.485Z",
			"issued": "2015-11-17T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"William Kennedy with Brian Ketelsen and Erik St. Martin"
			],
			"publishers": [
				"Manning Publications"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go in Action",
			"description": "<span><span><p><b>Summary</b></p><p><em>Go in Action</em> introduces the Go language, guiding you from\ninquisitive developer to Go guru. The book begins by introducing\nthe unique features and concepts of Go. Then, you'll get hands-on\nexperience writing real-world applications including websites and\nnetwork servers, as well as techniques to manipulate and convert\ndata at speeds that will make your friends jealous.</p><p><b>About the Technology</b></p><p>Application development can be tricky enough even when you\naren’t dealing with complex systems programming problems like\nweb-scale concurrency and real-time performance. While it’s\npossible to solve these common issues with additional tools and\nframeworks, Go handles them right out of the box, making for a more\nnatural and productive coding experience. Developed at Google, Go\npowers nimble startups as well as big enterprises—companies\nthat rely on high-performing services in their infrastructure.</p><p><b>About the Book</b></p><p><em>Go in Action</em> is for any intermediate-level developer who\nhas experience with other programming languages and wants a\njump-start in learning Go or a more thorough understanding of the\nlanguage and its internals. This book provides an intensive,\ncomprehensive, and idiomatic view of Go. It focuses on the\nspecification and implementation of the language, including topics\nlike language syntax, Go’s type system, concurrency,\nchannels, and testing.</p><p><b>What’s Inside</b></p><li><p>Language specification and implementation</p></li><li><p>Go’s type system</p></li><li><p>Internals of Go’s data structures</p></li><li><p>Testing and benchmarking</p></li><p><b>About the Reader</b></p><p>This book assumes you’re a working developer proficient\nwith another language like Java, Ruby, Python, C#, or C++.</p><p><b>About the Authors</b></p><p>William Kennedy is a seasoned software developer and author of\nthe blog GoingGo.Net. Brian Ketelsen and Erik St. Martin are the\norganizers of GopherCon and coauthors of the Go-based Skynet\nframework.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781617291784/",
			"web_url": "/library/view/go-in-action/9781617291784/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 392,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T13:30:37.243Z",
			"average_rating": 4735,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 17,
			"popularity": 981506587,
			"report_score": 80500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781617291784/",
			"date_added": "2019-08-30T17:13:47.697Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781786468666/",
			"archive_id": "9781786468666",
			"ourn": "urn:orm:book:9781786468666",
			"isbn": "9781786468666",
			"last_modified_time": "2021-07-23T15:15:14.969Z",
			"issued": "2017-07-27T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Nic Jackson"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Building Microservices with Go",
			"description": "<span><span><p><b>Your one-stop guide to the common patterns and practices, showing you how to apply these using the Go programming language</b></p><p><b>About This Book</b></p><ul><li>This short, concise, and practical guide is packed with real-world examples of building microservices with Go</li><li>It is easy to read and will benefit smaller teams who want to extend the functionality of their existing systems</li><li>Using this practical approach will save your money in terms of maintaining a monolithic architecture and demonstrate capabilities in ease of use</li></ul><p><b>Who This Book Is For</b></p><p>You should have a working knowledge of programming in Go, including writing and compiling basic applications. However, no knowledge of RESTful architecture, microservices, or web services is expected. If you are looking to apply techniques to your own projects, taking your first steps into microservice architecture, this book is for you.</p><p><b>What You Will Learn</b></p><ul><li>Plan a microservice architecture and design a microservice</li><li>Write a microservice with a RESTful API and a database</li><li>Understand the common idioms and common patterns in microservices architecture</li><li>Leverage tools and automation that helps microservices become horizontally scalable</li><li>Get a grounding in containerization with Docker and Docker-Compose, which will greatly accelerate your development lifecycle</li><li>Manage and secure Microservices at scale with monitoring, logging, service discovery, and automation</li><li>Test microservices and integrate API tests in Go</li></ul><p><b>In Detail</b></p><p>Microservice architecture is sweeping the world as the de facto pattern to build web-based applications. Golang is a language particularly well suited to building them. Its strong community, encouragement of idiomatic style, and statically-linked binary artifacts make integrating it with other technologies and managing microservices at scale consistent and intuitive. This book will teach you the common patterns and practices, showing you how to apply these using the Go programming language.</p><p>It will teach you the fundamental concepts of architectural design and RESTful communication, and show you patterns that provide manageable code that is supportable in development and at scale in production. We will provide you with examples on how to put these concepts and patterns into practice with Go.</p><p>Whether you are planning a new application or working in an existing monolith, this book will explain and illustrate with practical examples how teams of all sizes can start solving problems with microservices. It will help you understand Docker and Docker-Compose and how it can be used to isolate microservice dependencies and build environments. We finish off by showing you various techniques to monitor, test, and secure your microservices.</p><p>By the end, you will know the benefits of system resilience of a microservice and the advantages of Go stack.</p><p><b>Style and approach</b></p><p>The step-by-step tutorial focuses on building microservices. Each chapter expands upon the previous one, teaching you the main skills and techniques required to be a successful microservice practitioner.</p><p>Downloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at http://www.PacktPub.com. If you purchased this book elsewhere, you can visit http://www.PacktPub.com/support and register to have the code file.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781786468666/",
			"web_url": "/library/view/building-microservices-with/9781786468666/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 569,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T22:08:57.707Z",
			"average_rating": 3950,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 10,
			"popularity": 980344894,
			"report_score": 39500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781786468666/",
			"date_added": "2019-08-30T07:02:29.443Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781491941997/",
			"archive_id": "9781491941997",
			"ourn": "urn:orm:book:9781491941997",
			"isbn": "9781491941959",
			"last_modified_time": "2021-05-11T19:05:49.236Z",
			"issued": "2016-01-22T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Caleb Doxsey"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Introducing Go",
			"description": "<span><span><span><span><span><p>Perfect for beginners familiar with programming basics, this hands-on guide provides an easy introduction to Go, the general-purpose programming language from Google. Author Caleb Doxsey covers the language’s core features with step-by-step instructions and exercises in each chapter to help you practice what you learn. By the time you finish this book, not only will you be able to write real Go programs, you'll be ready to tackle advanced techniques.</p></span></span></span></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781491941997/",
			"web_url": "/library/view/introducing-go/9781491941997/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 104,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T22:35:06.544Z",
			"average_rating": 4275,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 20,
			"popularity": 977956689,
			"report_score": 85500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781491941997/",
			"date_added": "2019-08-30T17:16:38.193Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781617292569/",
			"archive_id": "9781617292569",
			"ourn": "urn:orm:book:9781617292569",
			"isbn": "9781617292569",
			"last_modified_time": "2021-05-11T22:51:15.241Z",
			"issued": "2016-07-08T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Sau Sheong Chang"
			],
			"publishers": [
				"Manning Publications"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Web Programming",
			"description": "<span><span><p><b>Summary</b></p><p><em>Go Web Programming</em> teaches you how to build scalable,\nhigh-performance web applications in Go using modern design\nprinciples.</p><p><b>About the Technology</b></p><p>The Go language handles the demands of scalable,\nhigh-performance web applications by providing clean and fast\ncompiled code, garbage collection, a simple concurrency model, and\na fantastic standard library. It’s perfect for writing\nmicroservices or building scalable, maintainable systems.</p><p><b>About the Book</b></p><p><em>Go Web Programming</em> teaches you how to build web\napplications in Go using modern design principles. You’ll\nlearn how to implement the dependency injection design pattern for\nwriting test doubles, use concurrency in web applications, and\ncreate and consume JSON and XML in web services. Along the way,\nyou’ll discover how to minimize your dependence on external\nframeworks, and you’ll pick up valuable productivity\ntechniques for testing and deploying your applications.</p><p><b>What’s Inside</b></p><li><p>Basics</p></li><li><p>Testing and benchmarking</p></li><li><p>Using concurrency</p></li><li><p>Deploying to standalone servers, PaaS, and Docker</p></li><li><p>Dozens of tips, tricks, and techniques</p></li><p><b>About the Reader</b></p><p>This book assumes you’re familiar with Go language basics\nand the general concepts of web development.</p><p><b>About the Author</b></p><p>Sau Sheong Chang is Managing Director of Digital Technology at\nSingapore Power and an active contributor to the Ruby and Go\ncommunities.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781617292569/",
			"web_url": "/library/view/go-web-programming/9781617292569/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 478,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T04:19:09.650Z",
			"average_rating": 4400,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 10,
			"popularity": 974131175,
			"report_score": 44000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781617292569/",
			"date_added": "2019-08-30T13:37:44.172Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780134771922/",
			"archive_id": "9780134771922",
			"ourn": "urn:orm:book:9780134771922",
			"isbn": "9780134771922",
			"last_modified_time": "2020-05-18T22:36:26.560Z",
			"issued": "2017-12-08T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"George Ornbo"
			],
			"publishers": [
				"Sams"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go in 24 Hours, Sams Teach Yourself: Next Generation Systems Programming with Golang, First Edition",
			"description": "<span><p>In just 24 sessions of one hour or less, <i>Sams Teach Yourself Go in 24 Hours</i> will help new and experienced programmers build software that’s simpler, more reliable, and far more scalable. This book’s straightforward, step-by-step approach guides you from setting up your environment through testing and deploying powerful solutions. Using practical examples, expert Go developer George Ornbo walks you through Go’s fundamental constructs, demonstrates its breakthrough features for concurrent and network programming, and illuminates Go’s powerful new idioms. Every lesson builds on what you’ve already learned, giving you a rock-solid foundation for real-world success.</p><p> </p><p><b>Step-by-step instructions</b> carefully walk you through the most common Go programming tasks and techniques</p><p><b>Quizzes and exercises</b> help you test your knowledge and stretch your skills</p><p><b>Practical, hands-on examples</b> show you how to apply what you learn</p><p><b>Notes and Tips</b> point out shortcuts, solutions, and problems to avoid</p><p><b>Two bonus chapters available online:</b> Hour 25, “Creating a RESTful JSON API,” and Hour 26 “Creating a TCP Chat Server”</p><p> </p><p>Learn how to…</p><p>· Get productive quickly with Go development tools and web servers</p><p>· Master core features, including strings, functions, structs, and methods</p><p>· Work with types, variables, functions, and control structures</p><p>· Make the most of Go’s arrays, slices, and maps</p><p>· Write powerful concurrent software with Goroutines and channels</p><p>· Handle program errors smoothly</p><p>· Promote code reuse with packages</p><p>· Master Go’s unique idioms for highly effective coding</p><p>· Use regular expressions and time/date functions</p><p>· Test and benchmark Go code</p><p>· Write basic command-line programs, HTTP servers, and HTTP clients</p><p>· Efficiently move Go code into production</p><p>· Build basic TCP chat servers and JSON APIs</p><p>Register your book at <a href=\"http://informit.com/register\">informit.com/register</a> for convenient access to the two bonus chapters online, downloads, updates, and/or corrections as they become available.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780134771922/",
			"web_url": "/library/view/go-in-24/9780134771922/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 533,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:58:49.175Z",
			"average_rating": 3667,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 6,
			"popularity": 968980895,
			"report_score": 22000,
			"cover_url": "https://learning.oreilly.com/library/cover/9780134771922/",
			"date_added": "2019-08-30T04:21:33.495Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781941222737/",
			"archive_id": "9781941222737",
			"ourn": "urn:orm:book:9781941222737",
			"isbn": "9781937785659",
			"last_modified_time": "2021-05-11T20:42:22.640Z",
			"issued": "2014-06-30T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Paul Butcher"
			],
			"publishers": [
				"Pragmatic Bookshelf"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Seven Concurrency Models in Seven Weeks",
			"description": "<span><span><p>Your software needs to leverage multiple cores, handle thousands of users and terabytes of data, and continue working in the face of both hardware and software failure. Concurrency and parallelism are the keys, and <i>Seven Concurrency Models in Seven Weeks</i> equips you for this new world. See how emerging technologies such as actors and functional programming address issues with traditional threads and locks development. Learn how to exploit the parallelism in your computer's GPU and leverage clusters of machines with MapReduce and Stream Processing. And do it all with the confidence that comes from using tools that help you write crystal clear, high-quality code.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781941222737/",
			"web_url": "/library/view/seven-concurrency-models/9781941222737/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 376,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-12-07T19:15:59.071Z",
			"average_rating": 4000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 7,
			"popularity": 967479319,
			"report_score": 28000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781941222737/",
			"date_added": "2019-08-31T07:14:17.234Z",
			"topics": [
				"48e22a8f-d8f8-4bdc-9760-6437bb1c9c04"
			],
			"topics_payload": [
				{
					"uuid": "48e22a8f-d8f8-4bdc-9760-6437bb1c9c04",
					"slug": "concurrency",
					"name": "Concurrency",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781484271995/",
			"archive_id": "9781484271995",
			"ourn": "urn:orm:book:9781484271995",
			"isbn": "9781484271995",
			"last_modified_time": "2022-05-14T08:11:22.289Z",
			"issued": "2021-10-22T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Barry Feigenbaum, Ph.D."
			],
			"publishers": [
				"Apress"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go for Java Programmers: Learn the Google Go Programming Language",
			"description": "<span><p>Get an in-depth introduction to the Go programming language and its associated standard runtime libraries. This book is targeted towards programmers that already know the Java programming language and uses that Java knowledge to direct the learning of Go. You will get a deep understanding of the Go language and obtain a good introduction to the extensive Go standard libraries. </p><p>This book teaches Go through clear descriptions of Go features, contrasting them with similar Java features and via providing extensive code examples. After reading this book you will be knowledgeable enough about Go and its libraries to begin doing effective programming using the Go language.  </p><p>Go for Java Programmers is structured more like a tutorial than a reference document. It covers key features of Go, but not every little detail as a reference might. Its goal is to get you competent enough in Go and its runtime that you can begin to effectively write Go programs.  </p><p><b>What You Will Learn</b></p><ul><li>Examine the key Go Runtime libraries and how they compare to Java      libraries<br/></li><li>See when it is appropriate to use the Go language instead of the      Java language</li><li>Read and understand programs written in Go</li><li>Write many programs in Go</li><li>Determine when Go is an appropriate language to develop      applications in</li><li>Discover how the Go and Java languages and development experience compare and contrast</li></ul><p><b>Who This Book Is For</b></p>\n\nPrimarily existing professional Java programmers or students that already know something about Java. A basic understanding of Java is expected. Some basic programming experience with imperative languages is expected.<p></p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781484271995/",
			"web_url": "/library/view/go-for-java/9781484271995/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 519,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-05-14T08:12:33.999Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 966797554,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781484271995/",
			"date_added": "2021-10-23T20:05:51.334Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781617293092/",
			"archive_id": "9781617293092",
			"ourn": "urn:orm:book:9781617293092",
			"isbn": "9781617293092",
			"last_modified_time": "2021-05-11T20:40:52.945Z",
			"issued": "2018-09-04T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Nathan Youngman and Roger Peppé"
			],
			"publishers": [
				"Manning Publications"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Get Programming with Go",
			"description": "<span><p/><p><b>Summary</b></p><p><i>Get Programming with Go</i> introduces you to the powerful Go language without confusing jargon or high-level theory. By working through 32 quick-fire lessons, you’ll quickly pick up the basics of the innovative Go programming language!</p><p><b>About the Technology</b></p><p>Go is a small programming language designed by Google to tackle big problems. Large projects mean large teams with people of varying levels of experience. Go offers a small, yet capable, language that can be understood and used by anyone, no matter their experience.</p><p><b>About the Book</b></p><p>Hobbyists, newcomers, and professionals alike can benefit from a fast, modern language; all you need is the right resource! <i>Get Programming with Go</i> provides a hands-on introduction to Go language fundamentals, serving as a solid foundation for your future programming projects. You’ll master Go syntax, work with types and functions, and explore bigger ideas like state and concurrency, with plenty of exercises to lock in what you learn.</p><p><b>What’s Inside</b></p><ul><li>Language concepts like slices, interfaces, pointers, and concurrency</li><li>Seven capstone projects featuring spacefaring gophers, Mars rovers, ciphers, and simulations</li><li>All examples run in the Go Playground — no installation required!</li></ul><p><b>About the Reader</b></p><p>This book is for anyone familiar with computer programming, as well as anyone with the desire to learn.</p><p><b>About the Authors</b></p><p>Nathan Youngman organizes the Edmonton Go meetup and is a mentor with Canada Learning Code. Roger Peppé contributes to Go and runs the Newcastle upon Tyne Go meetup.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781617293092/",
			"web_url": "/library/view/get-programming-with/9781617293092/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 494,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:35:03.688Z",
			"average_rating": 4722,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 9,
			"popularity": 962309937,
			"report_score": 42500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781617293092/",
			"date_added": "2019-08-29T22:45:13.927Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781119786191/",
			"archive_id": "9781119786191",
			"ourn": "urn:orm:book:9781119786191",
			"isbn": "9781119786191",
			"last_modified_time": "2021-08-04T22:49:16.357Z",
			"issued": "2021-04-27T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Wei-Meng Lee"
			],
			"publishers": [
				"For Dummies"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Programming Language For Dummies",
			"description": "<span><p><b>Ready, set, program with Go! </b></p><p>Now is the perfect time to learn the Go Programming Language. It’s one of the most in-demand languages among tech recruiters and developers love its simplicity and power. <i>Go Programming Language For Dummies</i> is an easy way to add this top job skill to your toolkit. Written for novice and experienced coders alike, this book traverses basic syntax, writing functions, organizing data, building packages, and interfacing with APIs. </p><p>Go—or GoLang, as it’s also known—has proven to be a strong choice for developers creating applications for the cloud-based world we live in. This book will put you on the path to using the language that’s created some of  today’s leading web applications, so you can steer your career where you want to Go! </p><ul><li>Learn how Go works and start writing programs and modules </li><li>Install and implement the most powerful third-party Go packages </li><li>Use Go in conjunction with web services and MySQL databases </li><li>Keep your codebase organized and use Go to structure data </li></ul><p>With this book, you can join the growing numbers of developers using Go to create 21st century solutions. Step inside to take start writing code that puts data in users’ hands. </p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781119786191/",
			"web_url": "/library/view/go-programming-language/9781119786191/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 289,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T04:01:02.961Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 961997941,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781119786191/",
			"date_added": "2021-08-04T22:48:07.253Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781098122102/",
			"archive_id": "9781098122102",
			"ourn": "urn:orm:book:9781098122102",
			"isbn": "9781098122096",
			"last_modified_time": "2022-02-02T15:07:00.987Z",
			"issued": "2023-07-25T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Sau Sheong Chang"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Cookbook",
			"description": "<span><div><p>Go is an increasingly popular language for programming everything from web applications to distributed network services. This practical guide provides recipes to help you unravel common problems and perform useful tasks when working with Go. Each recipe includes self-contained code solutions that you can freely use, along with a discussion of how and why they work. Programmers new to Go can quickly ramp up their knowledge while accomplishing useful tasks, and experienced Go developers can save time by cutting and pasting proven code directly into their applications.</p><p>Recipes include:</p><ul><li>Creating a module</li><li>Calling code from another module</li><li>Returning and handling an error</li><li>Converting strings to numbers (or converting numbers to strings)</li><li>Modifying multiple characters in a string</li><li>Creating substrings from a string</li><li>Capturing string input</li><li>And so much more</li></ul></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781098122102/",
			"web_url": "/library/view/go-cookbook/9781098122102/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 22,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-02-02T15:08:04.792Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 961577585,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781098122102/",
			"date_added": "2022-02-02T15:06:50.029Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781789132762/",
			"archive_id": "9781789132762",
			"ourn": "urn:orm:book:9781789132762",
			"isbn": "9781789132762",
			"last_modified_time": "2021-05-11T22:12:50.395Z",
			"issued": "2018-11-27T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Corey Scott"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Hands-On Dependency Injection in Go",
			"description": "<span><p><b>Explore various dependency injection methods in Go such as monkey patching, constructor injection, and method injection</b></p><h4>Key Features</h4><ul><li>Learn to evaluate Code UX and make it better\n</li><li>Explore SOLID principles and understand how they relate to dependency injection\n</li><li>Use Google's wire framework to simplify dependence management\n</li></ul><h4>Book Description</h4><p>Hands-On Dependency Injection in Go takes you on a journey, teaching you about refactoring existing code to adopt dependency injection (DI) using various methods available in Go.\n</p><p>Of the six methods introduced in this book, some are conventional, such as constructor or method injection, and some unconventional, such as just-in-time or config injection. Each method is explained in detail, focusing on their strengths and weaknesses, and is followed with a step-by-step example of how to apply it. With plenty of examples, you will learn how to leverage DI to transform code into something simple and flexible. You will also discover how to generate and leverage the dependency graph to spot and eliminate issues. Throughout the book, you will learn to leverage DI in combination with test stubs and mocks to test otherwise tricky or impossible scenarios.\n</p><p>Hands-On Dependency Injection in Go takes a pragmatic approach and focuses heavily on the code, user experience, and how to achieve long-term benefits through incremental changes.\n</p><p>By the end of this book, you will have produced clean code that's easy to test.</p><h4>What you will learn</h4><ul><li>Understand the benefits of DI\n</li><li>Explore SOLID design principles and how they relate to Go\n</li><li>Analyze various dependency injection patterns available in Go\n</li><li>Leverage DI to produce high-quality, loosely coupled Go code\n</li><li>Refactor existing Go code to adopt DI\n</li><li>Discover tools to improve your code's testability and test coverage\n</li><li>Generate and interpret Go dependency graphs</li></ul><h4>Who this book is for</h4><p>Hands-On Dependency Injection in Go is for programmers with a few year s experience in any language and a basic understanding of Go. If you wish to produce clean, loosely coupled code that is inherently easier to test, this book is for you.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781789132762/",
			"web_url": "/library/view/hands-on-dependency-injection/9781789132762/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 428,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-25T21:42:22.785Z",
			"average_rating": 4667,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 959167482,
			"report_score": 14000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781789132762/",
			"date_added": "2019-08-29T21:16:55.664Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781838647940/",
			"archive_id": "9781838647940",
			"ourn": "urn:orm:book:9781838647940",
			"isbn": "9781838647940",
			"last_modified_time": "2021-05-11T18:24:37.594Z",
			"issued": "2019-12-30T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Delio D'Anna",
				"Andrew Hayes",
				"Sam Hennessy",
				"Jeremy Leasor",
				"Gobin Sougrakpam",
				"Daniel Szabo"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "The Go Workshop",
			"description": "<span><p><b>Cut through the noise and get real results with a step-by-step approach to learning Go programming</b></p><h4>Key Features</h4><ul><li>Ideal for the Go beginner who is getting started for the first time\n</li><li>A step-by-step Go tutorial with exercises and activities that help build key skills\n</li><li>Structured to let you progress at your own pace, on your own terms\n</li><li>Use your physical print copy to redeem free access to the online interactive edition</li></ul><h4>Book Description</h4><p>You already know you want to learn Go, and the smart way to learn anything is to learn by doing. The Go Workshop focuses on building up your practical skills so that you can develop high-performing concurrent applications, or even create Go scripts to automate repetitive daily tasks. You'll learn from real examples that lead to real results.\n</p><p>Throughout The Go Workshop, you'll take an engaging step-by-step approach to understanding Go. You won't have to sit through any unnecessary theory. If you're short on time you can jump into a single exercise each day, or you can spend an entire weekend learning how to test and secure your Go applications. It's your choice. Learning on your terms, you'll build up and reinforce key skills in a way that feels rewarding.\n</p><p>Every physical print copy of The Go Workshop unlocks access to the interactive edition. With videos detailing all exercises and activities, you'll always have a guided solution. You can also benchmark yourself against assessments, track your progress, and receive content updates. You'll even earn secure credentials that you can share and verify online upon completion. It's a premium learning experience that's included with your printed copy. To redeem it, follow the instructions located at the start of your Go book.\n</p><p>Fast-paced and direct, The Go Workshop is the ideal companion for Go beginners. You'll build and iterate on your code like a software developer, learning along the way. This process means that you'll find that your new skills stick, embedded as best practice. A solid foundation for the years ahead.</p><h4>What you will learn</h4><ul><li>Get to grips with Go fundamentals and best practices\n</li><li>Learn how to effectively organize your code for production environments\n</li><li>Explore how third-party packages can help make you a better engineer\n</li><li>Keep your development process bug-free with unit tests and benchmarks</li></ul><h4>Who this book is for</h4><p>Our goal at Packt is to help you be successful, in whatever it is you choose to do. The Go Workshop is an ideal Go tutorial for the Go beginner who is just getting started. Pick up a Workshop today, and let Packt help you develop skills that stick with you for life.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781838647940/",
			"web_url": "/library/view/the-go-workshop/9781838647940/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 762,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T00:34:04.705Z",
			"average_rating": 4250,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 4,
			"popularity": 956264455,
			"report_score": 17000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781838647940/",
			"date_added": "2021-02-01T04:46:29.602Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781789804072/",
			"archive_id": "9781789804072",
			"ourn": "urn:orm:book:9781789804072",
			"isbn": "9781789804072",
			"last_modified_time": "2021-05-11T23:08:17.809Z",
			"issued": "2019-07-05T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Alex Guerrieri"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Hands-On System Programming with Go",
			"description": "<span><p><b>Explore the fundamentals of systems programming starting from kernel API and filesystem to network programming and process communications</b></p><h4>Key Features</h4><ul><li>Learn how to write Unix and Linux system code in Golang v1.12\n</li><li>Perform inter-process communication using pipes, message queues, shared memory, and semaphores\n</li><li>Explore modern Go features such as goroutines and channels that facilitate systems programming\n</li></ul><h4>Book Description</h4><p>System software and applications were largely created using low-level languages such as C or C++. Go is a modern language that combines simplicity, concurrency, and performance, making it a good alternative for building system applications for Linux and macOS.\n</p><p>This Go book introduces Unix and systems programming to help you understand the components the OS has to offer, ranging from the kernel API to the filesystem. You'll then familiarize yourself with Go and its specifications. You'll also learn how to optimize input and output operations with files and streams of data, which are useful tools in building pseudo-terminal applications. You'll gain insights into how processes communicate with each other, and learn about processes and daemon control using signals, pipes, and exit codes. This book will also enable you to understand how to use network communication using various protocols, including TCP and HTTP. As you advance, you'll focus on Go's best feature - concurrency, which will help you handle communication with channels and goroutines, other concurrency tools to synchronize shared resources, and the context package to write elegant applications. \n</p><p>By the end of this book, you will have learned how to build concurrent system applications using Go</p><h4>What you will learn</h4><ul><li>Explore concepts of system programming using Go and concurrency\n</li><li>Gain insights into Golang's internals, memory models and allocation\n</li><li>Familiarize yourself with the filesystem and IO streams in general\n</li><li>Handle and control processes and daemons' lifetime via signals and pipes\n</li><li>Communicate with other applications effectively using a network\n</li><li>Use various encoding formats to serialize complex data structures\n</li><li>Become well-versed in concurrency with channels, goroutines, and sync\n</li><li>Use concurrency patterns to build robust and performant system applications</li></ul><h4>Who this book is for</h4><p>If you are a developer who wants to learn system programming with Go, this book is for you. Although no knowledge of Unix and Linux system programming is necessary, intermediate knowledge of Go will help you understand the concepts covered in the book</p><p>Downloading the example code for this ebook: You can download the example code files for this ebook on GitHub at the following link: <a href=\"https://github.com/PacktPublishing/Hands-On-System-Programming-with-Go\">https://github.com/PacktPublishing/Hands-On-System-Programming-with-Go</a>. If you require support please email: customercare@packt.com </p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781789804072/",
			"web_url": "/library/view/hands-on-system-programming/9781789804072/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 637,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T04:59:40.403Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 955078776,
			"report_score": 15000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781789804072/",
			"date_added": "2021-04-18T14:12:34.878Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788390552/",
			"archive_id": "9781788390552",
			"ourn": "urn:orm:book:9781788390552",
			"isbn": "9781788390552",
			"last_modified_time": "2021-05-11T18:14:37.531Z",
			"issued": "2017-06-12T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Vladimir Vivien",
				"Mario Castro Contreras",
				"Mat Ryer"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go: Design Patterns for Real-World Projects",
			"description": "<span><p><b>An insightful guide to learning the Go programming language</b></p><p><b>About This Book</b></p><ul><li>Get insightful coverage of Go programming syntax, constructs, and idioms to help you understand Go code</li><li>Get a full explanation of all the known GoF design patterns in Go, including comprehensive theory and examples</li><li>Learn to apply the nuances of the Go language, and get to know the open source community that surrounds it to implement a wide range of start-up quality projects</li></ul><p><b>Who This Book Is For</b></p><p>Beginners to Go who are comfortable in other OOP languages like Java, C#, or Python will find this course interesting and beneficial.</p><p><b>What You Will Learn</b></p><ul><li>Install and configure the Go development environment to quickly get started with your first program</li><li>Use the basic elements of the language including source code structure, variables, constants, and control flow primitives</li><li>Get to know all the basic syntax and tools you need to start coding in Go</li><li>Create unique instances that cannot be duplicated within a program</li><li>Build quirky and fun projects from scratch while exploring patterns, practices, and techniques, as well as a range of different technologies</li><li>Create websites and data services capable of massive scaling using Go's net/http package,</li><li>Explore RESTful patterns as well as low-latency WebSocket APIs</li><li>Interact with a variety of remote web services to consume capabilities, ranging from authentication and authorization to a fully functioning thesaurus</li></ul><p><b>In Detail</b></p><p>The Go programming language has firmly established itself as a favorite for building complex and scalable system applications. Go offers a direct and practical approach to programming that lets programmers write correct and predictable code using concurrency idioms and a full-featured standard library. This practical guide is full of real-world examples to help you get started with Go in no time at all.</p><p>You'll start by understanding the fundamentals of Go, then get a detailed description of the Go data types, program structures, and Maps. After that, you'll learn how to use Go concurrency idioms to avoid pitfalls and create programs that are exact in expected behavior. Next, you will get familiar with the tools and libraries that are available in Go to write and exercise tests, benchmarking, and code coverage. After that, you will be able to utilize some of the most important features of GO such as Network Programming and OS integration to build efficient applications.  </p><p>Then you'll start applying your skills to build some amazing projects in Go. You will learn to develop high-quality command-line tools that utilize the powerful shell capabilities and perform well using Go's built-in concurrency mechanisms. Scale, performance, and high availability lie at the heart of our projects, and the lessons learned throughout the sections will arm you with everything you need to build world-class solutions. You will get a feel for app deployment using Docker and Google App Engine. Each project could form the basis of a start-up, which means they are directly applicable to modern software markets. With these skills in hand, you will be able to conquer all your fears of application development and go on to build large, robust and succinct apps in Go. </p><p>This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products:</p><ol><li>Learning Go Programming</li><li>Go Design Patterns</li><li>Go Programming Blueprints, Second Edition</li></ol><p><b>Style and approach</b></p><p>Full of real-world, practical examples, this course teaches you the widely used design patterns and best practices in Go in a step-by-step manner. It also provides fun projects that involve building applications from scratch.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781788390552/",
			"web_url": "/library/view/go-design-patterns/9781788390552/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 1156,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T03:05:29.986Z",
			"average_rating": 3250,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 6,
			"popularity": 954123219,
			"report_score": 19500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788390552/",
			"date_added": "2019-08-30T07:56:19.690Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781633430075/",
			"archive_id": "9781633430075",
			"ourn": "urn:orm:book:9781633430075",
			"isbn": "9781633430075",
			"last_modified_time": "2021-05-11T20:19:34.958Z",
			"issued": "2016-08-19T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Matt Butcher",
				"Matt Farina"
			],
			"publishers": [
				"Manning Publications"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go in Practice",
			"description": "<span><p><b>Summary</b></p><p><em>Go in Practice</em> guides you through 70 real-world\ntechniques in key areas like package management, microservice\ncommunication, and more. Following a cookbook-style\nProblem/Solution/Discussion format, this practical handbook builds\non the foundational concepts of the Go language and introduces\nspecific strategies you can use in your day-to-day\napplications.</p><p><b>About the Technology</b></p><p>Go may be the perfect systems language. Built with simplicity,\nconcurrency, and modern applications in mind, Go provides the core\ntool set for rapidly building web, cloud, and systems applications.\nIf you know a language like Java or C#, it’s easy to get\nstarted with Go; the trick is finding the practical\ndirt-under-the-fingernails techniques that you need to build\nproduction-ready code.</p><p><b>About the Book</b></p><p><em>Go in Practice</em> guides you through dozens of real-world\ntechniques in key areas. Following a cookbook-style\nProblem/Solution/Discussion format, this practical handbook builds\non the foundational concepts of the Go language and introduces\nspecific strategies you can use in your day-to-day applications.\nYou’ll learn techniques for building web services, using Go\nin the cloud, testing and debugging, routing, network applications,\nand much more. After finishing this book, you will be ready to\nbuild sophisticated cloud-native Go applications.</p><p><b>What’s Inside</b></p><li><p>Dozens of specific, practical Golang techniques</p></li><li><p>Using Go for devops and cloudops</p></li><li><p>Writing RESTful web services and microservices</p></li><li><p>Practical web dev techniques</p></li><p><b>About the Reader</b></p><p>Written for experienced developers who have already started\nexploring Go and want to use it effectively in a production\nsetting.</p><p><b>About the Authors</b></p><p>Matt Butcher is a software architect at Deis. Matt Farina is a\nPrincipal Engineer in the Advanced Technology Group at Hewlett\nPackard Enterprise. They are both authors, speakers, and regular\nopen source contributors.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781633430075/",
			"web_url": "/library/view/go-in-practice/9781633430075/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 494,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T22:10:44.916Z",
			"average_rating": 4600,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 5,
			"popularity": 951302517,
			"report_score": 23000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781633430075/",
			"date_added": "2019-08-30T13:06:50.901Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781789130751/",
			"archive_id": "9781789130751",
			"ourn": "urn:orm:book:9781789130751",
			"isbn": "9781789130751",
			"last_modified_time": "2021-05-11T22:30:58.302Z",
			"issued": "2019-03-28T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mina Andrawos"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Hands-On Full Stack Development with Go",
			"description": "<span><p><b>Create a real-world application in Go and explore various frameworks and methodologies for full-stack development</b></p><h4>Key Features</h4><ul><li>Build a responsive front end by using the powerful React framework\n</li><li>Build web APIs and middleware in the Go language by making use of the popular Gin framework\n</li><li>Build an Isomorphic Go React application via GopherJS\n</li><li>Perform unit tests, and benchmarking on your web API</li></ul><h4>Book Description</h4><p>The Go programming language has been rapidly adopted by developers for building web applications. With its impressive performance and ease of development, Go enjoys the support of a wide variety of open source frameworks, for building scalable and high-performant web services and apps. Hands-On Full Stack Development with Go is a comprehensive guide that covers all aspects of full stack development with Go.\n</p><p>This clearly written, example-rich book begins with a practical exposure to Go development and moves on to build a frontend with the popular React framework. From there, you will build RESTful web APIs utilizing the Gin framework. After that, we will dive deeper into important software backend concepts, such as connecting to the database via an ORM, designing routes for your services, securing your services, and even charging credit cards via the popular Stripe API. We will also cover how to test, and benchmark your applications efficiently in a production environment. In the concluding chapters, we will cover isomorphic developments in pure Go by learning about GopherJS. As you progress through the book, you'll gradually build a musical instrument online store application from scratch.\n</p><p>By the end of the book, you will be confident in taking on full stack web applications in Go.</p><h4>What you will learn</h4><ul><li>Understand Go programming by building a real-world application\n</li><li>Learn the React framework to develop a frontend for your application\n</li><li>Understand isomorphic web development utilizing the GopherJS framework\n</li><li>Explore methods to write RESTful web APIs in Go using the Gin framework\n</li><li>Learn practical topics such as ORM layers, secure communications, and Stripe's API\n</li><li>Learn methods to benchmark and test web APIs in Go</li></ul><h4>Who this book is for</h4><p>Hands-On Full Stack Development with Go will appeal to developers who are looking to start building amazing full stack web applications in Go. Basic knowhow of Go language and JavaScript is expected. The book targets web developers who are looking to move to the Go language.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781789130751/",
			"web_url": "/library/view/hands-on-full-stack/9781789130751/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 380,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T13:30:58.962Z",
			"average_rating": 2750,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 4,
			"popularity": 947407609,
			"report_score": 11000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781789130751/",
			"date_added": "2020-02-24T09:16:19.973Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781838559335/",
			"archive_id": "9781838559335",
			"ourn": "urn:orm:book:9781838559335",
			"isbn": "9781838559335",
			"last_modified_time": "2021-09-13T07:08:33.497Z",
			"issued": "2021-08-29T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mihalis Tsoukalos"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Mastering Go - Second Edition",
			"description": "<span><p><b>Publisher's Note: This edition from 2019 is outdated and is not compatible with the latest version of Go. A new third edition, updated for 2021 and featuring the latest in Go programming, has now been published.</b></p><h4>Key Features</h4><ul><li>Second edition of the bestselling guide to advanced Go programming, expanded to cover machine learning, more Go packages and a range of modern development techniques</li><li>Completes the Go developer's education with real-world guides to building high-performance production systems</li><li>Packed with practical examples and patterns to apply to your own development work</li><li>Clearly explains Go nuances and features to remove the frustration from Go development</li></ul><h4>Book Description</h4><p>Often referred to (incorrectly) as Golang, Go is the high-performance systems language of the future. Mastering Go, Second Edition helps you become a productive expert Go programmer, building and improving on the groundbreaking first edition.</p><p>Mastering Go, Second Edition shows how to put Go to work on real production systems. For programmers who already know the Go language basics, this book provides examples, patterns, and clear explanations to help you deeply understand Go's capabilities and apply them in your programming work.</p><p>The book covers the nuances of Go, with in-depth guides on types and structures, packages, concurrency, network programming, compiler design, optimization, and more. Each chapter ends with exercises and resources to fully embed your new knowledge.</p><p>This second edition includes a completely new chapter on machine learning in Go, guiding you from the foundation statistics techniques through simple regression and clustering to classification, neural networks, and anomaly detection. Other chapters are expanded to cover using Go with Docker and Kubernetes, Git, WebAssembly, JSON, and more.</p><p>If you take the Go programming language seriously, the second edition of this book is an essential guide on expert techniques.</p><h4>What you will learn</h4><ul><li>Clear guidance on using Go for production systems</li><li>Detailed explanations of how Go internals work, the design choices behind the language, and how to optimize your Go code</li><li>A full guide to all Go data types, composite types, and data structures</li><li>Master packages, reflection, and interfaces for effective Go programming</li><li>Build high-performance systems networking code, including server and client-side applications</li><li>Interface with other systems using WebAssembly, JSON, and gRPC</li><li>Write reliable, high-performance concurrent code</li><li>Build machine learning systems in Go, from simple statistical regression to complex neural networks</li></ul><h4>Who this book is for</h4><p>Mastering Go, Second Edition is for Go programmers who already know the language basics, and want to become expert Go practitioners.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781838559335/",
			"web_url": "/library/view/mastering-go/9781838559335/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 889,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-12-16T04:46:59.205Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 943781428,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781838559335/",
			"date_added": "2021-09-13T07:00:38.220Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788294287/",
			"archive_id": "9781788294287",
			"ourn": "urn:orm:book:9781788294287",
			"isbn": "9781788294287",
			"last_modified_time": "2021-05-11T21:36:51.049Z",
			"issued": "2017-12-28T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Naren Yellavula"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Building RESTful Web services with Go",
			"url": "https://learning.oreilly.com/api/v1/book/9781788294287/",
			"web_url": "/library/view/building-restful-web/9781788294287/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 364,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T02:11:12.400Z",
			"description": "<span><span><p><b>Explore the necessary concepts of REST API development by building few real world services from scratch.</b></p><p><b>About This Book</b></p><ul><li>Follow best practices and explore techniques such as clustering and caching to achieve a reactive, scalable web service</li><li>Leverage the Buffalo Framework to quickly implement RESTful endpoints</li><li>Learn to implement a client library for a RESTful web service using Go</li></ul><p><b>Who This Book Is For</b></p><p>This book is intended for those who want to learn to build RESTful web services with a framework like Buffalo. To make best use of the code samples included in the book, you should have a basic knowledge of Go programming.</p><p><b>What You Will Learn</b></p><ul><li>Create HTTP handler and introspect the Gorilla Mux router</li><li>OAuth 2 implementation with Go</li><li>Build RESTFul API with go-restful, Revel.Go and Buffalo Go</li><li>Create REST API with MongoDB and Go</li><li>Build a working client library and unit test for REST API</li><li>Debug, test, and profile RESTful APIs with each of the frameworks</li><li>Optimize and scale REST API using microservices</li></ul><p><b>In Detail</b></p><p>REST is an architectural style that tackles the challenges of building scalable web services and in today's connected world, APIs have taken a central role on the web. APIs provide the fabric through which systems interact, and REST has become synonymous with APIs. The depth, breadth, and ease of use of Go, makes it a breeze for developers to work with it to build robust Web APIs. This book takes you through the design of RESTful web services and leverages a framework like Buffalo Go to implement these services. </p><p>The book starts with a brief introduction to REST API development and how it transformed the modern web. You will learn how to handle routing and authentication of web services along with working with middleware for internal service. The book explains how to use Go frameworks to build RESTful web services and work with MongoDB to create REST API. You will learn how to integrate Postgres SQL and JSON with a Go web service and build a client library in Go for consuming REST API. You will learn how to scale APIs using the microservice architecture and deploy the REST APIs using Nginx as a proxy server. Finally you will learn how to metricize a REST API using an API Gateway. </p><p>By the end of the book you will be proficient in building RESTful APIs in Go.</p><p><b>Style and approach</b></p><p>This book is a step-by-step, hands-on guide to designing and building RESTful web services.</p><p><b>Explore the necessary concepts of REST API development by building few real world services from scratch.</b></p><p><b>About This Book</b></p><ul><li>Follow best practices and explore techniques such as clustering and caching to achieve a reactive, scalable web service</li><li>Leverage the Gin Framework to quickly implement RESTful endpoints</li><li>Learn to implement a client library for a RESTful web service using Go</li></ul><p><b>Who This Book Is For</b></p><p>This book is intended for those who want to learn to build RESTful web services with a framework like Gin. To make best use of the code samples included in the book, you should have a basic knowledge of Go programming.</p><p><b>What You Will Learn</b></p><ul><li>Create HTTP handler and introspect the Gorilla Mux router</li><li>OAuth 2 implementation with Go</li><li>Build RESTFul API with Gin Framework</li><li>Create REST API with MongoDB and Go</li><li>Build a working client library and unit test for REST API</li><li>Debug, test, and profile RESTful APIs with each of the frameworks</li><li>Optimize and scale REST API using microservices</li></ul><p><b>In Detail</b></p><p>REST is an architectural style that tackles the challenges of building scalable web services and in today's connected world, APIs have taken a central role on the web. APIs provide the fabric through which systems interact, and REST has become synonymous with APIs. The depth, breadth, and ease of use of Go, makes it a breeze for developers to work with it to build robust Web APIs. This book takes you through the design of RESTful web services and leverages a framework like Gin</p><p>to implement these services.</p><p>The book starts with a brief introduction to REST API development and how it transformed the modern web. You will learn how to handle routing and authentication of web services along with working with middleware for internal service. The book explains how to use Go frameworks to build RESTful web services and work with MongoDB to create REST API. You will learn how to integrate Postgres SQL and JSON with a Go web service and build a client library in Go for consuming REST API. You will learn how to scale APIs using the microservice architecture and deploy the REST APIs using Nginx as a proxy server. Finally you will learn how to metricize a REST API using an API Gateway.</p><p>By the end of the book you will be proficient in building RESTful APIs in Go.</p><p><b>Style and approach</b></p><p>This book is a step-by-step, hands-on guide to designing and building RESTful web services.</p><p>Downloading the example code for this book You can download the example code files for all Packt books you have purchased from your account at http://www.PacktPub.com. If you purchased this book elsewhere, you can visit http://www.PacktPub.com/support and register to have the files e-mailed directly to you.</p></span></span>",
			"average_rating": 3750,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 4,
			"popularity": 943329133,
			"report_score": 15000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788294287/",
			"date_added": "2019-08-30T03:51:40.601Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781484226919/",
			"archive_id": "9781484226919",
			"ourn": "urn:orm:book:9781484226919",
			"isbn": "9781484226919",
			"last_modified_time": "2021-05-11T22:38:02.405Z",
			"issued": "2017-05-18T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Jan Newmarch"
			],
			"publishers": [
				"Apress"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Network Programming with Go: Essential Skills for Using and Securing Networks",
			"description": "<span><p>Dive into key topics in network architecture and Go, such as data serialization, application level protocols, character sets and encodings. This book covers network architecture and gives an overview of the Go language as a primer, covering the latest Go release.</p><p>Beyond the fundamentals, <i>Network Programming with Go</i> covers key networking and security issues such as HTTP and HTTPS, templates, remote procedure call (RPC), web sockets including HTML5 web sockets, and more.</p><p>Additionally, author Jan Newmarch guides you in building and connecting to a complete web server based on Go. This book can serve as both as an essential learning guide and reference on Go networking.</p><p><b>What You'll Learn</b></p><ul><li>Master network programming with Go</li><li>Carry out data serialization</li><li>Use application-level protocols</li><li>Manage character sets and encodings</li><li>Deal with HTTP(S)</li><li>Build a complete Go-based web server</li><li>Work with RPC, web sockets, and more</li></ul><p><b>Who This Book Is For</b></p><p>Experienced Go programmers and other programmers with some experience with the Go language.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781484226919/",
			"web_url": "/library/view/network-programming-with/9781484226919/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 342,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T06:14:45.658Z",
			"average_rating": 4500,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 938698964,
			"report_score": 4500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781484226919/",
			"date_added": "2019-08-30T08:24:31.545Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781786468949/",
			"archive_id": "9781786468949",
			"ourn": "urn:orm:book:9781786468949",
			"isbn": "9781786468949",
			"last_modified_time": "2022-04-15T18:55:23.856Z",
			"issued": "2016-10-27T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mat Ryer"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Programming Blueprints - Second Edition",
			"description": "<span><span><p><b>Build real-world, production-ready solutions in Go using cutting-edge technology and techniques</b></p><p><b>About This Book</b></p><li><p>Get up to date with Go and write code capable of delivering massive world-class scale performance and availability</p></li><li><p>Learn to apply the nuances of the Go language, and get to know the open source community that surrounds it to implement a wide range of start-up quality projects</p></li><li><p>Write interesting and clever but simple code, and learn skills and techniques that are directly transferrable to your own projects</p></li><p><b>Who This Book Is For</b></p><p>If you are familiar with Go and are want to put your knowledge to work, then this is the book for you. Go programming knowledge is a must.</p><p><b>What You Will Learn</b></p><li><p>Build quirky and fun projects from scratch while exploring patterns, practices, and techniques, as well as a range of different technologies</p></li><li><p>Create websites and data services capable of massive scale using Go’s net/http package, exploring RESTful patterns as well as low-latency WebSocket APIs</p></li><li><p>Interact with a variety of remote web services to consume capabilities ranging from authentication and authorization to a fully functioning thesaurus</p></li><li><p>Develop high-quality command-line tools that utilize the powerful shell capabilities and perform well using Go’s in-built concurrency mechanisms</p></li><li><p>Build microservices for larger organizations using the Go Kit library</p></li><li><p>Implement a modern document database as well as high-throughput messaging queue technology to put together an architecture that is truly ready to scale</p></li><li><p>Write concurrent programs and gracefully manage the execution of them and communication by smartly using channels</p></li><li><p>Get a feel for app deployment using Docker and Google App Engine</p></li><p><b>In Detail</b></p><p>Go is the language of the Internet age, and the latest version of Go comes with major architectural changes. Implementation of the language, runtime, and libraries has changed significantly. The compiler and runtime are now written entirely in Go. The garbage collector is now concurrent and provides dramatically lower pause times by running in parallel with other Go routines when possible.</p><p>This book will show you how to leverage all the latest features and much more. This book shows you how to build powerful systems and drops you into real-world situations. You will learn to develop high-quality command-line tools that utilize the powerful shell capabilities and perform well using Go’s in-built concurrency mechanisms. Scale, performance, and high availability lie at the heart of our projects, and the lessons learned throughout this book will arm you with everything you need to build world-class solutions. You will get a feel for app deployment using Docker and Google App Engine. Each project could form the basis of a start-up, which means they are directly applicable to modern software markets.</p><p><b>Style and approach</b></p><p>This book provides fun projects that involve building applications from scratch. These projects will teach you to build chat applications, a distributed system, and a recommendation system.</p><p>Downloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at <a href=\"http://www.PacktPub.com\">http://www.PacktPub.com</a>. If you purchased this book elsewhere, you can visit <a href=\"http://www.PacktPub.com/support\">http://www.PacktPub.com/support</a> and register to have the code file.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781786468949/",
			"web_url": "/library/view/go-programming-blueprints/9781786468949/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 432,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-04-15T19:08:58.568Z",
			"average_rating": 4500,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 933222746,
			"report_score": 13500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781786468949/",
			"date_added": "2019-08-30T12:10:14.210Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780134505787/",
			"archive_id": "9780134505787",
			"ourn": "urn:orm:book:9780134505787",
			"isbn": "9780134505787",
			"last_modified_time": "2021-05-11T22:31:16.908Z",
			"issued": "2016-12-23T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Kevin Hoffman",
				"Dan Nemeth"
			],
			"publishers": [
				"Addison-Wesley Professional"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Cloud Native Go: Building Web Applications and Microservices for the Cloud with Go and React",
			"description": "<span><span><p><b>The Complete Guide to Building Cloud-Based Services</b><br/><br/><b>Cloud Native Go</b> shows developers how to build massive cloud\napplications that meet the insatiable demands of today’s\ncustomers, and will dynamically scale to handle virtually any\nvolume of data, traffic, or users.<br/>\n <br/>\nKevin Hoffman and Dan Nemeth describe the modern cloud-native\napplication in detail, illuminating factors, disciplines, and\nhabits associated with rapid, reliable cloud-native development.\nThey also introduce Go, a “simply elegant”\nhigh-performance language that is especially well-suited for cloud\ndevelopment.<br/>\n<br/>\nYou’ll walk through creating microservices in Go, adding\nfront-end web components using ReactJS and Flux, and mastering\nadvanced Go-based cloud-native techniques. Hoffman and Nemeth show\nhow to build a continuous delivery pipeline with tools like\nWercker, Docker, and Dockerhub; automatically push apps to leading\nplatforms; and systematically monitor app performance in\nproduction.<br/>\n<br/></p><li><p>Learn “The Way of the Cloud”: why developing good\ncloud software is fundamentally about mindset and discipline</p></li><li><p>Discover why Go is ideal for cloud-native microservices\ndevelopment</p></li><li><p>Plan cloud apps that support continuous delivery and\ndeployment</p></li><li><p>Design service ecosystems, and then build them in a test-first\nmanner</p></li><li><p>Push work-in-progress to a cloud</p></li><li><p>Use Event Sourcing and CQRS patterns to react and respond to\nenormous volume and throughput</p></li><li><p>Secure cloud-based web applications: do’s, don’ts,\nand options</p></li><li><p>Create reactive applications in the cloud with third-party\nmessaging providers</p></li><li><p>Build massive-scale, cloud-friendly GUIs with React and\nFlux</p></li><li><p>Monitor dynamic scaling, failover, and fault tolerance in the\ncloud</p></li></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780134505787/",
			"web_url": "/library/view/cloud-native-go/9780134505787/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 408,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T04:33:35.905Z",
			"average_rating": 3750,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 4,
			"popularity": 926706504,
			"report_score": 15000,
			"cover_url": "https://learning.oreilly.com/library/cover/9780134505787/",
			"date_added": "2019-08-30T13:23:29.839Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780596802424/",
			"archive_id": "9780596802424",
			"ourn": "urn:orm:book:9780596802424",
			"isbn": "9780596521530",
			"last_modified_time": "2021-05-11T22:22:34.144Z",
			"issued": "2009-05-15T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Clay Breshears"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "The Art of Concurrency",
			"description": "<span><span><div><p>If you're looking to take full advantage of multi-core processors with concurrent programming, this practical book provides the knowledge and hands-on experience you need. <em>The Art of Concurrency</em> is one of the few resources to focus on implementing algorithms in the shared-memory model of multi-core processors, rather than just theoretical models or distributed-memory architectures. The book provides detailed explanations and usable samples to help you transform algorithms from serial to parallel code, along with advice and analysis for avoiding mistakes that programmers typically make when first attempting these computations.<br/><br/>Written by an Intel engineer with over two decades of parallel and concurrent programming experience, this book will help you:</p><p/><ul><li>Understand parallelism and concurrency</li><li>Explore differences between programming for shared-memory and distributed-memory</li><li>Learn guidelines for designing multithreaded applications, including testing and tuning</li><li>Discover how to make best use of different threading libraries, including Windows threads, POSIX threads, OpenMP, and Intel Threading Building Blocks</li><li>Explore how to implement concurrent algorithms that involve sorting, searching, graphs, and other practical computations</li></ul><p><em>The Art of Concurrency</em> shows you how to keep algorithms scalable to take advantage of new processors with even more cores. For developing parallel code algorithms for concurrent programming, this book is a must.</p></div></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780596802424/",
			"web_url": "/library/view/the-art-of/9780596802424/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 535,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:05:53.736Z",
			"average_rating": 4400,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 5,
			"popularity": 926014303,
			"report_score": 22000,
			"cover_url": "https://learning.oreilly.com/library/cover/9780596802424/",
			"date_added": "2019-09-02T01:52:53.413Z",
			"topics": [
				"48e22a8f-d8f8-4bdc-9760-6437bb1c9c04"
			],
			"topics_payload": [
				{
					"uuid": "48e22a8f-d8f8-4bdc-9760-6437bb1c9c04",
					"slug": "concurrency",
					"name": "Concurrency",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781789805789/",
			"archive_id": "9781789805789",
			"ourn": "urn:orm:book:9781789805789",
			"isbn": "9781789805789",
			"last_modified_time": "2021-06-12T11:41:59.200Z",
			"issued": "2020-03-24T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Bob Strecansky"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Hands-On High Performance with Go",
			"description": "<span><p><b>Proven methodologies and concurrency techniques that will help you write faster and better code with Go programming</b></p><h4>Key Features</h4><ul><li>Explore Go's profiling tools to write faster programs by identifying and fixing bottlenecks\n</li><li>Address Go-specific performance issues such as memory allocation and garbage collection\n</li><li>Delve into the subtleties of concurrency and discover how to successfully implement it in everyday applications</li></ul><h4>Book Description</h4><p>Go is an easy-to-write language that is popular among developers thanks to its features such as concurrency, portability, and ability to reduce complexity. This Golang book will teach you how to construct idiomatic Go code that is reusable and highly performant.\n</p><p>Starting with an introduction to performance concepts, you'll understand the ideology behind Go's performance. You'll then learn how to effectively implement Go data structures and algorithms along with exploring data manipulation and organization to write programs for scalable software. This book covers channels and goroutines for parallelism and concurrency to write high-performance code for distributed systems. As you advance, you'll learn how to manage memory effectively. You'll explore the compute unified device architecture (CUDA) application programming interface (API), use containers to build Go code, and work with the Go build cache for quicker compilation. You'll also get to grips with profiling and tracing Go code for detecting bottlenecks in your system. Finally, you'll evaluate clusters and job queues for performance optimization and monitor the application for performance regression.\n</p><p>By the end of this Go programming book, you'll be able to improve existing code and fulfill customer requirements by writing efficient programs.</p><h4>What you will learn</h4><ul><li>Organize and manipulate data effectively with clusters and job queues\n</li><li>Explore commonly applied Go data structures and algorithms\n</li><li>Write anonymous functions in Go to build reusable apps\n</li><li>Profile and trace Go apps to reduce bottlenecks and improve efficiency\n</li><li>Deploy, monitor, and iterate Go programs with a focus on performance\n</li><li>Dive into memory management and CPU and GPU parallelism in Go</li></ul><h4>Who this book is for</h4><p>This Golang book is a must for developers and professionals who have an intermediate-to-advanced understanding of Go programming, and are interested in improving their speed of code execution.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781789805789/",
			"web_url": "/library/view/hands-on-high-performance/9781789805789/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 452,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T09:05:39.944Z",
			"average_rating": 2500,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 915383335,
			"report_score": 7500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781789805789/",
			"date_added": "2021-06-12T11:36:00.308Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781264258154/",
			"archive_id": "9781264258154",
			"ourn": "urn:orm:book:9781264258154",
			"isbn": "9781264258154",
			"last_modified_time": "2021-05-11T19:18:00.747Z",
			"issued": "2021-05-25T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Tanmay Bakshi",
				"Baheer Kamal"
			],
			"publishers": [
				"McGraw-Hill Education TAB"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Tanmay Teaches Go: The Ideal Language for Backend Developers",
			"description": "<span><b>Write your own efficient, performant, and lightweight programs using Go </b><b><br/></b><br/>\nQuickly start developing your own Google Go programs using the practical information contained in this engaging resource. Social media personalities Tanmay Bakshi and Baheer Kamal show, step by step, how to develop custom applications that fully utilize Go’s lightweight runtime and concurrency features. <i>Tanmay Teaches Go: The Ideal Language for Backend Developers</i> teaches by doing. This book guides you through the development and programming processes and features detailed examples, code samples, and time-saving tips.<br/>\n<br/>\nInside, you’ll learn to:<br/>\n<p/>\n<ul><li>Install Go on Windows, Linux, or macOS devices</li><li>Get up and running with writing your own Go apps</li><li>Define variables and use them in your programs</li><li>Work with statements, functions, loops, and arrays</li><li>Use Go modules to simplify program development</li><li>Utilize built-in and third-party packages</li><li>Write custom packages that fit your programming needs</li><li>Understand classic structures and algorithms</li><li>Improve performance using Go routines and concurrency</li><li>Import external code—even code not written in Go!<br/>\n<br/>\n<br/>\n</li></ul>\n\n  </span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781264258154/",
			"web_url": "/library/view/tanmay-teaches-go/9781264258154/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 246,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T03:56:57.659Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 908517607,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781264258154/",
			"date_added": "2021-05-11T19:16:45.388Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781789800982/",
			"archive_id": "9781789800982",
			"ourn": "urn:orm:book:9781789800982",
			"isbn": "9781789800982",
			"last_modified_time": "2021-06-12T11:37:15.571Z",
			"issued": "2019-07-19T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Aaron Torres"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Programming Cookbook - Second Edition",
			"description": "<span><p><b>Tackle the trickiest of problems in Go programming with this practical guide</b></p><h4>Key Features</h4><ul><li>Develop applications for different domains using modern programming techniques\n</li><li>Tackle common problems when it comes to parallelism, concurrency, and reactive programming in Go\n</li><li>Work with ready-to-execute code based on the latest version of Go</li></ul><h4>Book Description</h4><p>Go (or Golang) is a statically typed programming language developed at Google. Known for its vast standard library, it also provides features such as garbage collection, type safety, dynamic-typing capabilities, and additional built-in types. This book will serve as a reference while implementing Go features to build your own applications.\n</p><p>This Go cookbook helps you put into practice the advanced concepts and libraries that Golang offers. The recipes in the book follow best practices such as documentation, testing, and vendoring with Go modules, as well as performing clean abstractions using interfaces. You'll learn how code works and the common pitfalls to watch out for. The book covers basic type and error handling, and then moves on to explore applications, such as websites, command-line tools, and filesystems, that interact with users. You'll even get to grips with parallelism, distributed systems, and performance tuning.\n</p><p>By the end of the book, you'll be able to use open source code and concepts in Go programming to build enterprise-class applications without any hassle.</p><h4>What you will learn</h4><ul><li>Work with third-party Go projects and modify them for your use\n</li><li>Write Go code using modern best practices\n</li><li>Manage your dependencies with the new Go module system\n</li><li>Solve common problems encountered when dealing with backend systems or DevOps\n</li><li>Explore the Go standard library and its uses\n</li><li>Test, profile, and fine-tune Go applications</li></ul><h4>Who this book is for</h4><p>If you're a web developer, programmer, or enterprise developer looking for quick solutions to common and not-so-common problems in Go programming, this book is for you. Basic knowledge of the Go language is assumed.</p><p>Downloading the example code for this ebook: You can download the example code files for this ebook on GitHub at the following link: <a href=\"https://github.com/PacktPublishing/Go-Programming-Cookbook-Second-Edition\">https://github.com/PacktPublishing/Go-Programming-Cookbook-Second-Edition</a>. If you require support please email: customercare@packt.com</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781789800982/",
			"web_url": "/library/view/go-programming-cookbook/9781789800982/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 421,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T11:48:44.052Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 2,
			"popularity": 904887171,
			"report_score": 10000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781789800982/",
			"date_added": "2021-06-12T11:36:50.458Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788627917/",
			"archive_id": "9781788627917",
			"ourn": "urn:orm:book:9781788627917",
			"isbn": "9781788627917",
			"last_modified_time": "2021-06-28T04:15:02.214Z",
			"issued": "2018-01-31T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"John Daniel Leon"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Security with Go",
			"description": "<span><p><b>The first stop for your security needs when using Go, covering host, network, and cloud security for ethical hackers and defense against intrusion</b></p><p><b>About This Book</b></p><ul><li>First introduction to Security with Golang</li><li>Adopting a Blue Team/Red Team approach</li><li>Take advantage of speed and inherent safety of Golang</li><li>Works as an introduction to security for Golang developers</li><li>Works as a guide to Golang security packages for recent Golang beginners</li></ul><p><b>Who This Book Is For</b></p><p>Security with Go is aimed at developers with basics in Go to the level that they can write their own scripts and small programs without difficulty. Readers should be familiar with security concepts, and familiarity with Python security applications and libraries is an advantage, but not a necessity. </p><p><b>What You Will Learn</b></p><ul><li>Learn the basic concepts and principles of secure programming</li><li>Write secure Golang programs and applications</li><li>Understand classic patterns of attack</li><li>Write Golang scripts to defend against network-level attacks</li><li>Learn how to use Golang security packages</li><li>Apply and explore cryptographic methods and packages</li><li>Learn the art of defending against brute force attacks</li><li>Secure web and cloud applications</li></ul><p><b>In Detail</b></p><p>Go is becoming more and more popular as a language for security experts. Its wide use in server and cloud environments, its speed and ease of use, and its evident capabilities for data analysis, have made it a prime choice for developers who need to think about security.</p><p>Security with Go is the first Golang security book, and it is useful for both blue team and red team applications. With this book, you will learn how to write secure software, monitor your systems, secure your data, attack systems, and extract information.</p><p>Defensive topics include cryptography, forensics, packet capturing, and building secure web applications.</p><p>Offensive topics include brute force, port scanning, packet injection, web scraping, social engineering, and post exploitation techniques.</p><p><b>Style and approach</b></p><p>John Leon has divided the book into two parts which present the team playing defense against anyone breaking into servers and the team playing (ethical!) offense to perform said attacks. All Go scripts and programs are workable solutions that can be easily understood and expanded upon by anyone with a system administrator's level view of networking and cloud-based systems. Golang developers will profit from a swift and incisive approach to security.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781788627917/",
			"web_url": "/library/view/security-with-go/9781788627917/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 423,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:53:17.553Z",
			"average_rating": 4900,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 5,
			"popularity": 894019653,
			"report_score": 24500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788627917/",
			"date_added": "2021-06-28T04:08:49.909Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781484211885/",
			"archive_id": "9781484211885",
			"ourn": "urn:orm:book:9781484211885",
			"isbn": "9781484211885",
			"last_modified_time": "2021-05-11T21:09:34.922Z",
			"issued": "2016-11-18T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Shiju Varghese"
			],
			"publishers": [
				"Apress"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Recipes: A Problem-Solution Approach",
			"description": "<span><span><p>Solve your Go problems using a problem-solution approach. Each recipe is a self-contained answer to a practical programming problem in Go. <i>Go Recipes</i> contains recipes that deal with the fundamentals of Go, allowing you to build simple, reliable, and efficient software. Other topics include working with data using modern NoSQL databases such as MongoDB and RethinkDB. The book provides in-depth guidance for building highly scalable backend APIs in Go for your mobile client applications and web client applications.</p><p>All this means that you'll be able to write programs that get the most out of multicore and networked machines, using Go's novel type system that enables flexible and modular program construction. You'll see how to test your Go applications so they are ready for deployment, as well as learning how to write HTTP servers to offer you maximum flexibility when dealing with remote clients.</p><p><b>What You'll Learn</b></p><ul><li><p>Work with the core fundamentals of Go</p></li><li><p>Persist data into NoSQL databases</p></li><li><p>Build scalable backend APIs</p></li><li><p>Test your Go applications</p></li><li><p>Create HTTP web servers in Go</p></li><li/></ul><p><b>Who This Book Is For</b></p><p>Experienced programmers who have some or no prior experience with Go.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781484211885/",
			"web_url": "/library/view/go-recipes-a/9781484211885/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 314,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T09:25:21.942Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 890660597,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781484211885/",
			"date_added": "2019-08-30T10:50:10.530Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781484210529/",
			"archive_id": "9781484210529",
			"ourn": "urn:orm:book:9781484210529",
			"isbn": "9781484210529",
			"last_modified_time": "2021-05-11T22:59:15.616Z",
			"issued": "2016-01-02T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Shiju Varghese"
			],
			"publishers": [
				"Apress"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Web Development with Go: Building Scalable Web Apps and RESTful Services",
			"description": "<span><span><p/><p>Take a deep dive into web development using the Go programming language to build web apps and RESTful services to create reliable and efficient software. <em>Web Development with Go</em> provides Go language fundamentals and then moves on to advanced web development concepts and successful deployment of Go web apps to the cloud.</p><p><em>Web Development with Go<strong> </strong></em>will teach you how to develop scalable real-world web apps, RESTful services, and backend systems with Go. The book starts off by covering Go programming language fundamentals as a prerequisite for web development. After a thorough understanding of the basics, the book delves into web development using the built-in package, net/http. With each chapter you’ll be introduced to new concepts for gradually building a real-world web system. </p><p>The book further shows you how to integrate Go with other technologies. For example, it provides an overview of using MongoDB as a means of persistent storage, and provides an end-to-end REST API sample as well. Developers looking for a full-fledged web development framework for building web apps will be introduced to Beego. The book then moves on to demonstrate how to deploy web apps to the cloud using the Google Cloud platform. Finally, the book introduces Docker, a revolutionary container technology platform for deploying containerized Go web apps to the cloud.</p><p><em>Web Development with Go<strong> </strong></em>provides:</p><li>• Fundamentals for building real-world web apps in Go</li><li>• Through coverage of prerequisites and practical code examples </li><li>• Demo web apps for attaining a deeper understanding of web development </li><li>A reference REST API app which can be used to build scalable real-world backend services in Go</li><li>• A through demonstration of deploying web apps to the Cloud using the Google Cloud platform, and Docker for deploying Go servers </li>Go is a high-performance language while providing greater level of developer productivity, therefore <em>Web Development with Go </em>equips you with the necessary skills and knowledge required for effectively building robust and efficient web apps by leveraging the features of Go.</span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781484210529/",
			"web_url": "/library/view/web-development-with/9781484210529/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 383,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T06:04:21.548Z",
			"average_rating": 4167,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 6,
			"popularity": 890648040,
			"report_score": 25000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781484210529/",
			"date_added": "2019-08-30T16:27:02.327Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781787286740/",
			"archive_id": "9781787286740",
			"ourn": "urn:orm:book:9781787286740",
			"isbn": "9781787286740",
			"last_modified_time": "2021-06-15T17:28:50.639Z",
			"issued": "2018-04-23T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Arpit Aggarwal"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Web Development Cookbook",
			"description": "<span><p><b>86 recipes on how to build fast, scalable, and powerful web services and applications with Go</b></p><b>About This Book</b><ul><li>Become proficient in RESTful web services</li><li>Build scalable, high-performant web applications in Go</li><li>Get acquainted with Go frameworks for web development</li></ul><b>Who This Book Is For</b><p>This book is for Go developers interested in learning how to use Go to build powerful web applications. A background in web development is expected.</p><b>What You Will Learn</b><ul><li>Create a simple HTTP and TCP web server and understand how it works</li><li>Explore record in a MySQL and MongoDB database</li><li>Write and consume RESTful web service in Go</li><li>Invent microservices in Go using Micro ? a microservice toolkit</li><li>Create and Deploy the Beego application with Nginx</li><li>Deploy Go web application and Docker containers on an AWS EC2 instance</li></ul><b>In Detail</b><p>Go is an open source programming language that is designed to scale and support concurrency at the language level. This gives you the liberty to write large concurrent web applications with ease. From creating web application to deploying them on Amazon Cloud Services, this book will be your one-stop guide to learn web development in Go. The Go Web Development Cookbook teaches you how to create REST services, write microservices, and deploy Go Docker containers. Whether you are new to programming or a professional developer, this book will help get you up to speed with web development in Go. We will focus on writing modular code in Go; in-depth informative examples build the base, one step at a time. You will learn how to create a server, work with static files, SQL, NoSQL databases, and Beego. You will also learn how to create and secure REST services, and create and deploy Go web application and Go Docker containers on Amazon Cloud Services. By the end of the book, you will be able to apply the skills you've gained in Go to create and explore web applications in any domain.</p><b>Style and approach</b><p>This book helps you learn core Go concepts faster by taking a recipe-based approach.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781787286740/",
			"web_url": "/library/view/go-web-development/9781787286740/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 399,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T04:33:28.648Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 889493554,
			"report_score": 5000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781787286740/",
			"date_added": "2021-06-15T17:22:42.520Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781787125643/",
			"archive_id": "9781787125643",
			"ourn": "urn:orm:book:9781787125643",
			"isbn": "9781787125643",
			"last_modified_time": "2021-07-22T10:25:26.938Z",
			"issued": "2017-09-26T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mihalis Tsoukalos"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Systems Programming",
			"description": "<span><span><p><b>Learning the new system’s programming language for all Unix-type systems</b></p><p><b>About This Book</b></p><ul><li>Learn how to write system's level code in Golang, similar to Unix/Linux systems code</li><li>Ramp up in Go quickly</li><li>Deep dive into Goroutines and Go concurrency to be able to take advantage of Go server-level constructs</li></ul><p><b>Who This Book Is For</b></p><p>Intermediate Linux and general Unix programmers. Network programmers from beginners to advanced practitioners. C and C++ programmers interested in different approaches to concurrency and Linux systems programming.</p><p><b>What You Will Learn</b></p><ul><li>Explore the Go language from the standpoint of a developer conversant with Unix, Linux, and so on</li><li>Understand Goroutines, the lightweight threads used for systems and concurrent applications</li><li>Learn how to translate Unix and Linux systems code in C to Golang code</li><li>How to write fast and lightweight server code</li><li>Dive into concurrency with Go</li><li>Write low-level networking code</li></ul><p><b>In Detail</b></p><p>Go is the new systems programming language for Linux and Unix systems. It is also the language in which some of the most prominent cloud-level systems have been written, such as Docker. Where C programmers used to rule, Go programmers are in demand to write highly optimized systems programming code.</p><p>Created by some of the original designers of C and Unix, Go expands the systems programmers toolkit and adds a mature, clear programming language. Traditional system applications become easier to write since pointers are not relevant and garbage collection has taken away the most problematic area for low-level systems code: memory management.</p><p>This book opens up the world of high-performance Unix system applications to the beginning Go programmer. It does not get stuck on single systems or even system types, but tries to expand the original teachings from Unix system level programming to all types of servers, the cloud, and the web.</p><p><b>Style and approach</b></p><p>This is the first book to introduce Linux and Unix systems programming in Go, a field for which Go has actually been developed in the first place.</p><p>Downloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at http://www.PacktPub.com. If you purchased this book elsewhere, you can visit http://www.PacktPub.com/support and register to have the code file.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781787125643/",
			"web_url": "/library/view/go-systems-programming/9781787125643/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 499,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:53:51.043Z",
			"average_rating": 3000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 886151503,
			"report_score": 3000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781787125643/",
			"date_added": "2019-08-30T05:27:27.963Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781785882104/",
			"archive_id": "9781785882104",
			"ourn": "urn:orm:book:9781785882104",
			"isbn": "9781785882104",
			"last_modified_time": "2021-05-11T21:26:19.301Z",
			"issued": "2017-09-26T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Daniel Whitenack"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Machine Learning With Go",
			"description": "<span><p><b>Build simple, maintainable, and easy to deploy machine learning applications.</b></p><p><b>About This Book</b></p><ul><li>Build simple, but powerful, machine learning applications that leverage Go's standard library along with popular Go packages.</li><li>Learn the statistics, algorithms, and techniques needed to successfully implement machine learning in Go</li><li>Understand when and how to integrate certain types of machine learning model in Go applications.</li></ul><p><b>Who This Book Is For</b></p><p>This book is for Go developers who are familiar with the Go syntax and can develop, build, and run basic Go programs. If you want to explore the field of machine learning and you love Go, then this book is for you! Machine Learning with Go will give readers the practical skills to perform the most common machine learning tasks with Go. Familiarity with some statistics and math topics is necessary.</p><p><b>What You Will Learn</b></p><ul><li>Learn about data gathering, organization, parsing, and cleaning.</li><li>Explore matrices, linear algebra, statistics, and probability.</li><li>See how to evaluate and validate models.</li><li>Look at regression, classification, clustering.</li><li>Learn about neural networks and deep learning</li><li>Utilize times series models and anomaly detection.</li><li>Get to grip with techniques for deploying and distributing analyses and models.</li><li>Optimize machine learning workflow techniques</li></ul><p><b>In Detail</b></p><p>The mission of this book is to turn readers into productive, innovative data analysts who leverage Go to build robust and valuable applications. To this end, the book clearly introduces the technical aspects of building predictive models in Go, but it also helps the reader understand how machine learning workflows are being applied in real-world scenarios.</p><p>Machine Learning with Go shows readers how to be productive in machine learning while also producing applications that maintain a high level of integrity. It also gives readers patterns to overcome challenges that are often encountered when trying to integrate machine learning in an engineering organization.</p><p>The readers will begin by gaining a solid understanding of how to gather, organize, and parse real-work data from a variety of sources. Readers will then develop a solid statistical toolkit that will allow them to quickly understand gain intuition about the content of a dataset. Finally, the readers will gain hands-on experience implementing essential machine learning techniques (regression, classification, clustering, and so on) with the relevant Go packages.</p><p>Finally, the reader will have a solid machine learning mindset and a powerful Go toolkit of techniques, packages, and example implementations.</p><p><b>Style and approach</b></p><p>This book connects the fundamental, theoretical concepts behind Machine Learning to practical implementations using the Go programming language.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781785882104/",
			"web_url": "/library/view/machine-learning-with/9781785882104/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 367,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T19:04:59.642Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 877696517,
			"report_score": 5000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781785882104/",
			"date_added": "2019-08-30T05:28:50.962Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788475273/",
			"archive_id": "9781788475273",
			"ourn": "urn:orm:book:9781788475273",
			"isbn": "9781788475273",
			"last_modified_time": "2021-07-27T17:54:28.889Z",
			"issued": "2018-02-27T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Radomir Sohlich"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Standard Library Cookbook",
			"description": "<span><p><b>Implement solutions by leveraging the power of the GO standard library and reducing dependency on external crates</b></p><p><b>About This Book</b></p><ul><li>Develop high quality, fast and portable applications by leveraging the power of Go Standard Library.</li><li>Practical recipes that will help you work with the standard library algorithms to boost your productivity as a Go developer.</li><li>Compose your own algorithms without forfeiting the simplicity and elegance of the Standard Library.</li></ul><p><b>Who This Book Is For</b></p><p>This book is for Go developers who would like to explore the power of Golang and learn how to use the Go standard library for various functionalities. The book assumes basic Go programming knowledge.</p><p><b>What You Will Learn</b></p><ul><li>Access environmental variables</li><li>Execute and work with child processes</li><li>Manipulate strings by performing operations such as search, concatenate, and so on</li><li>Parse and format the output of date/time information</li><li>Operate on complex numbers and effective conversions between different number formats and bases</li><li>Work with standard input and output</li><li>Handle filesystem operations and file permissions</li><li>Create TCP and HTTP servers, and access those servers with a client</li><li>Utilize synchronization primitives</li><li>Test your code</li></ul><p><b>In Detail</b></p><p>Google's Golang will be the next talk of the town, with amazing features and a powerful library. This book will gear you up for using golang by taking you through recipes that will teach you how to leverage the standard library to implement a particular solution. This will enable Go developers to take advantage of using a rock-solid standard library instead of third-party frameworks.</p><p>The book begins by exploring the functionalities available for interaction between the environment and the operating system. We will explore common string operations, date/time manipulations, and numerical problems.</p><p>We'll then move on to working with the database, accessing the filesystem, and performing I/O operations. From a networking perspective, we will touch on client and server-side solutions. The basics of concurrency are also covered, before we wrap up with a few tips and tricks.</p><p>By the end of the book, you will have a good overview of the features of the Golang standard library and what you can achieve with them. Ultimately, you will be proficient in implementing solutions with powerful standard libraries.</p><p><b>Style and approach</b></p><p>Solution based approach showcasing the power of Go standard library for easy practical implementations.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781788475273/",
			"web_url": "/library/view/go-standard-library/9781788475273/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 507,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T13:18:46.567Z",
			"average_rating": 4000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 868917840,
			"report_score": 4000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788475273/",
			"date_added": "2019-08-30T01:54:43.721Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781491982297/",
			"archive_id": "9781491982297",
			"ourn": "urn:orm:book:9781491982297",
			"isbn": "9781491982280",
			"last_modified_time": "2021-05-11T22:57:36.695Z",
			"issued": "2018-01-15T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Liz Rice"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Setting up your Go development docker environment",
			"description": "<span><p>Are you a Go programmer looking to introduce Docker containers into your workflow? In this lesson, you’ll learn how to set up a containerized development environment that rebuilds Go code automatically as you edit it. You’ll learn how to use tools such as Realize, and how to generate a small and efficient container image for production distribution using Docker Multistage Builds.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781491982297/",
			"web_url": "/library/view/setting-up-your/9781491982297/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 18,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:33:21.395Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 864591956,
			"report_score": 5000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781491982297/",
			"date_added": "2019-08-30T04:00:15.319Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788993401/",
			"archive_id": "9781788993401",
			"ourn": "urn:orm:book:9781788993401",
			"isbn": "9781788993401",
			"last_modified_time": "2021-05-11T22:19:38.616Z",
			"issued": "2018-11-30T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Xuanyi Chew"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Machine Learning Projects",
			"description": "<span><p><b>Work through exciting projects to explore the capabilities of Go and Machine Learning</b></p><h4>Key Features</h4><ul><li>Explore ML tasks and Go's machine learning ecosystem\n</li><li>Implement clustering, regression, classification, and neural networks with Go\n</li><li>Get to grips with libraries such as Gorgonia, Gonum, and GoCv for training models in Go\n</li></ul><h4>Book Description</h4><p>Go is the perfect language for machine learning; it helps to clearly describe complex algorithms, and also helps developers to understand how to run efficient optimized code. This book will teach you how to implement machine learning in Go to make programs that are easy to deploy and code that is not only easy to understand and debug, but also to have its performance measured.\n</p><p>The book begins by guiding you through setting up your machine learning environment with Go libraries and capabilities. You will then plunge into regression analysis of a real-life house pricing dataset and build a classification model in Go to classify emails as spam or ham. Using Gonum, Gorgonia, and STL, you will explore time series analysis along with decomposition and clean up your personal Twitter timeline by clustering tweets. In addition to this, you will learn how to recognize handwriting using neural networks and convolutional neural networks. Lastly, you'll learn how to choose the most appropriate machine learning algorithms to use for your projects with the help of a facial detection project.\n</p><p>By the end of this book, you will have developed a solid machine learning mindset, a strong hold on the powerful Go toolkit, and a sound understanding of the practical implementations of machine learning algorithms in real-world projects.</p><h4>What you will learn</h4><ul><li>Set up a machine learning environment with Go libraries\n</li><li>Use Gonum to perform regression and classification\n</li><li>Explore time series models and decompose trends with Go libraries\n</li><li>Clean up your Twitter timeline by clustering tweets\n</li><li>Learn to use external services for your machine learning needs\n</li><li>Recognize handwriting using neural networks and CNN with Gorgonia\n</li><li>Implement facial recognition using GoCV and OpenCV\n</li></ul><h4>Who this book is for</h4><p>If you're a machine learning engineer, data science professional, or Go programmer who wants to implement machine learning in your real-world projects and make smarter applications easily, this book is for you. Some coding experience in Golang and knowledge of basic machine learning concepts will help you in understanding the concepts covered in this book.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781788993401/",
			"web_url": "/library/view/go-machine-learning/9781788993401/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 440,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T00:30:05.660Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 858010403,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788993401/",
			"date_added": "2019-08-29T21:23:20.667Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780132764100/",
			"archive_id": "9780132764100",
			"ourn": "urn:orm:book:9780132764100",
			"last_modified_time": "2021-05-11T20:41:59.420Z",
			"issued": "2012-05-04T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mark Summerfield"
			],
			"publishers": [
				"Addison-Wesley Professional"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Programming in Go: Creating Applications for the 21st Century",
			"description": "<span><p><b>Your Hands-On Guide to Go, the\nRevolutionary New Language Designed for Concurrency, Multicore\nHardware, and Programmer Convenience</b></p><p>Today’s most exciting new programming\nlanguage, Go, is designed from the ground up to help you easily\nleverage all the power of today’s multicore hardware. With\nthis guide, pioneering Go programmer Mark Summerfield shows how to\nwrite code that takes full advantage of Go’s breakthrough\nfeatures and idioms.</p><p>Both a tutorial and a language reference,\n<b><em>Programming in Go</em></b> brings together all the knowledge\nyou need to evaluate Go, think in Go, and write high-performance\nsoftware with Go. Summerfield presents multiple idiom comparisons\nshowing exactly how Go improves upon older languages, calling\nspecial attention to Go’s key innovations. Along the way, he\nexplains everything from the absolute basics through Go’s\nlock-free channel-based concurrency and its flexible and unusual\nduck-typing type-safe approach to object-orientation.</p><p>Throughout, Summerfield’s approach is\nthoroughly practical. Each chapter offers multiple live code\nexamples designed to encourage experimentation and help you quickly\ndevelop mastery. Wherever possible, complete programs and packages\nare presented to provide realistic use cases, as well as exercises.\nCoverage includes</p><li><p>Quickly getting and installing Go, and building and running Go\nprograms</p></li><li><p>Exploring Go’s syntax, features, and extensive standard\nlibrary</p></li><li><p>Programming Boolean values, expressions, and numeric types</p></li><li><p>Creating, comparing, indexing, slicing, and formatting\nstrings</p></li><li><p>Understanding Go’s highly efficient built-in collection\ntypes: slices and maps</p></li><li><p>Using Go as a procedural programming language</p></li><li><p>Discovering Go’s unusual and flexible approach to object\norientation</p></li><li><p>Mastering Go’s unique, simple, and natural approach to\nfine-grained concurrency</p></li><li><p>Reading and writing binary, text, JSON, and XML files</p></li><li><p>Importing and using standard library packages, custom packages,\nand third-party packages</p></li><li><p>Creating, documenting, unit testing, and benchmarking custom\npackages</p></li></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780132764100/",
			"web_url": "/library/view/programming-in-go/9780132764100/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 683,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T00:07:15.215Z",
			"average_rating": 2800,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 10,
			"popularity": 854967431,
			"report_score": 28000,
			"cover_url": "https://learning.oreilly.com/library/cover/9780132764100/",
			"date_added": "2019-09-02T17:46:51.594Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781783286836/",
			"archive_id": "9781783286836",
			"ourn": "urn:orm:book:9781783286836",
			"isbn": "9781783286836",
			"last_modified_time": "2021-05-13T12:42:04.959Z",
			"issued": "2017-06-28T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Aaron Torres"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Cookbook",
			"description": "<span><p><b>Bridge the gap between basic understanding of Go and use of its advanced features</b></p><p><b>About This Book</b></p><ul><li>Discover a number of recipes and approaches to develop modern back-end applications</li><li>Put to use the best practices to combine the recipes for sophisticated parallel tools</li><li>This book is based on Go 1.8, which is the latest version</li></ul><p><b>Who This Book Is For</b></p><p>This book is for web developers, programmers, and enterprise developers. Basic knowledge of the Go language is assumed. Experience with back-end application development is not necessary, but may help understand the motivation behind some of the recipes.</p><p><b>What You Will Learn</b></p><ul><li>Test your application using advanced testing methodologies</li><li>Develop an awareness of application structures, interface design, and tooling</li><li>Create strategies for third-party packages, dependencies, and vendoring</li><li>Get to know tricks on treating data such as collections</li><li>Handle errors and cleanly pass them along to calling functions</li><li>Wrap dependencies in interfaces for ease of portability and testing</li><li>Explore reactive programming design patterns in Go</li></ul><p><b>In Detail</b></p><p>Go (a.k.a. Golang) is a statically-typed programming language first developed at Google. It is derived from C with additional features such as garbage collection, type safety, dynamic-typing capabilities, additional built-in types, and a large standard library.</p><p>This book takes off where basic tutorials on the language leave off. You can immediately put into practice some of the more advanced concepts and libraries offered by the language while avoiding some of the common mistakes for new Go developers.</p><p>The book covers basic type and error handling. It explores applications that interact with users, such as websites, command-line tools, or via the file system. It demonstrates how to handle advanced topics such as parallelism, distributed systems, and performance tuning. Lastly, it finishes with reactive and serverless programming in Go.</p><p><b>Style and approach</b></p><p>This guide is a handy reference for developers to quickly look up Go development patterns. It is a companion to other resources and a reference that will be useful long after reading it through the first time. Each recipe includes working, simple, and tested code that can be used as a reference or foundation for your own applications.</p><p>Downloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at http://www.PacktPub.com. If you purchased this book elsewhere, you can visit http://www.PacktPub.com/support and register to have the code file.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781783286836/",
			"web_url": "/library/view/go-cookbook/9781783286836/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 550,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T16:04:06.770Z",
			"average_rating": 4500,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 2,
			"popularity": 852980858,
			"report_score": 9000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781783286836/",
			"date_added": "2021-05-13T12:35:57.436Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781784395438/",
			"archive_id": "9781784395438",
			"ourn": "urn:orm:book:9781784395438",
			"isbn": "9781784395438",
			"last_modified_time": "2021-05-11T18:14:01.321Z",
			"issued": "2016-10-26T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Vladimir Vivien"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Learning Go Programming",
			"description": "<span><span><p><b>An insightful guide to learning the Go programming language</b></p><p><b>About This Book</b></p><ul><li>Insightful coverage of Go programming syntax, constructs, and idioms to help you understand Go code effectively</li><li>Push your Go skills, with topics such as, data types, channels, concurrency, object-oriented Go, testing, and network programming</li><li>Each chapter provides working code samples that are designed to help reader quickly understand respective topic</li></ul><p><b>Who This Book Is For</b></p><p>If you have prior exposure to programming and are interested in learning the Go programming language, this book is designed for you. It will quickly run you through the basics of programming to let you exploit a number of features offered by Go programming language.</p><p><b>What You Will Learn</b></p><ul><li>Install and configure the Go development environment to quickly get started with your first program.</li><li>Use the basic elements of the language including source code structure, variables, constants, and control flow primitives to quickly get started with Go</li><li>Gain practical insight into the use of Go's type system including basic and composite types such as maps, slices, and structs.</li><li>Use interface types and techniques such as embedding to create idiomatic object-oriented programs in Go.</li><li>Develop effective functions that are encapsulated in well-organized package structures with support for error handling and panic recovery.</li><li>Implement goroutine, channels, and other concurrency primitives to write highly-concurrent and safe Go code</li><li>Write tested and benchmarked code using Go’s built test tools</li><li>Access OS resources by calling C libraries and interact with program environment at runtime</li></ul><p><b>In Detail</b></p><p>The Go programming language has firmly established itself as a favorite for building complex and scalable system applications. Go offers a direct and practical approach to programming that let programmers write correct and predictable code using concurrency idioms and a full-featured standard library.</p><p>This is a step-by-step, practical guide full of real world examples to help you get started with Go in no time at all. We start off by understanding the fundamentals of Go, followed by a detailed description of the Go data types, program structures and Maps. After this, you learn how to use Go concurrency idioms to avoid pitfalls and create programs that are exact in expected behavior. Next, you will be familiarized with the tools and libraries that are available in Go for writing and exercising tests, benchmarking, and code coverage.</p><p>Finally, you will be able to utilize some of the most important features of GO such as, Network Programming and OS integration to build efficient applications. All the concepts are explained in a crisp and concise manner and by the end of this book; you would be able to create highly efficient programs that you can deploy over cloud.</p><p><b>Style and approach</b></p><p>The book is written to serve as a reader-friendly step-by-step guide to learning the Go programming language. Each topic is sequentially introduced to build on previous materials covered. Every concept is introduced with easy-to-follow code examples that focus on maximizing the understanding of the topic at hand.</p><p>Downloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at http://www.PacktPub.com. If you purchased this book elsewhere, you can visit http://www.PacktPub.com/support and register to have the code file.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781784395438/",
			"web_url": "/library/view/learning-go-programming/9781784395438/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 340,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T02:39:31.872Z",
			"average_rating": 4800,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 5,
			"popularity": 848004705,
			"report_score": 24000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781784395438/",
			"date_added": "2019-08-30T12:13:37.721Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781787123496/",
			"archive_id": "9781787123496",
			"ourn": "urn:orm:book:9781787123496",
			"isbn": "9781787123496",
			"last_modified_time": "2021-05-11T19:06:16.033Z",
			"issued": "2016-08-31T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Nathan Kozyra",
				"Mat Ryer"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go: Building Web Applications",
			"description": "<span><p><b>Build real-world, production-ready solutions by harnessing the powerful features of Go</b></p><p><b>About This Book</b></p><ul><li>An easy-to-follow guide that provides everything a developer needs to know to build end-to-end web applications in Go</li><li>Write interesting and clever, but simple code, and learn skills and techniques that are directly transferable to your own projects</li><li>A practical approach to utilize application scaffolding to design highly scalable programs that are deeply rooted in go routines and channels</li></ul><p><b>Who This Book Is For</b></p><p>This book is intended for developers who are new to Go, but have previous experience of building web applications and APIs.</p><p><b>What You Will Learn</b></p><ul><li>Build a fully featured REST API to enable client-side single page apps</li><li>Utilize TLS to build reliable and secure sites</li><li>Learn to apply the nuances of the Go language to implement a wide range of start-up quality projects</li><li>Create websites and data services capable of massive scale using Go's net/http package, exploring RESTful patterns as well as low-latency WebSocket APIs</li><li>Interact with a variety of remote web services to consume capabilities ranging from authentication and authorization to a fully functioning thesaurus</li><li>Explore the core syntaxes and language features that enable concurrency in Go</li><li>Understand when and where to use concurrency to keep data consistent and applications non-blocking, responsive, and reliable</li><li>Utilize advanced concurrency patterns and best practices to stay low-level without compromising the simplicity of Go itself</li></ul><p><b>In Detail</b></p><p>Go is an open source programming language that makes it easy to build simple, reliable, and efficient software. It is a statically typed language with syntax loosely derived from that of C, adding garbage collection, type safety, some dynamic-typing capabilities, additional built-in types such as variable-length arrays and key-value maps, and a large standard library.</p><p>This course starts with a walkthrough of the topics most critical to anyone building a new web application. Whether it's keeping your application secure, connecting to your database, enabling token-based authentication, or utilizing logic-less templates, this course has you covered. </p><p>Scale, performance, and high availability lie at the heart of the projects, and the lessons learned throughout this course will arm you with everything you need to build world-class solutions. It will also take you through the history of concurrency, how Go utilizes it, how Go differs from other languages, and the features and structures of Go's concurrency core. It will make you feel comfortable designing a safe, data-consistent, and high-performance concurrent application in Go.\nThis course is an invaluable resource to help you understand Go's powerful features to build simple, reliable, secure, and efficient web applications.</p><p><b>Style and approach</b></p><p>This course is a step-by-step guide, which starts off with the basics of go programming to build web applications and will gradually move on to cover intermediate and advanced topics. You will be going through this smooth transition by building interesting projects along with the authors, discussing significant options, and decisions at each stage, while keeping the programs lean, uncluttered, and as simple as possible.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781787123496/",
			"web_url": "/library/view/go-building-web/9781787123496/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 740,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T03:17:26.141Z",
			"average_rating": 2625,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 4,
			"popularity": 845080616,
			"report_score": 10500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781787123496/",
			"date_added": "2019-08-30T12:56:41.848Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780132918961/",
			"archive_id": "9780132918961",
			"ourn": "urn:orm:book:9780132918961",
			"isbn": "9780132918961",
			"last_modified_time": "2021-05-11T19:08:31.286Z",
			"issued": "2012-04-30T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"David Chisnall"
			],
			"publishers": [
				"Addison-Wesley Professional"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "The Go Programming Language Phrasebook",
			"description": "<span><span><p><em><b><em>The Go Programming Language\nPhrasebook</em></b></em></p><p>Essential Go code and idioms for all facets\nof the development process<em> </em></p><p>This guide gives you the code\n“phrases” you need to quickly and effectively complete\na wide variety of projects with Go, today’s most exciting new\nprogramming language.</p><p>Tested, easy-to-adapt code examples\nilluminate every step of Go development, helping you write highly\nscalable, concurrent software. You’ll master Go-specific\nidioms for working with strings, collections, arrays, error\nhandling, goroutines, slices, maps, channels, numbers, dates,\ntimes, files, networking, web apps, the runtime, and more.</p><p><b>Concise\nand Accessible</b></p><p>Easy to carry\nand easy to use: Ditch all those bulky books for one portable\npocket guide</p><p><b> </b></p><p><b>Flexible\nand Functional</b></p><p>Packed with\nmore than 100 customizable code snippets: Quickly create solid Go\ncode to solve just about any problem</p><p>Register your book at informit.com/register\nfor convenient access to downloads, updates, and corrections as\nthey become available.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780132918961/",
			"web_url": "/library/view/the-go-programming/9780132918961/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 243,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T04:03:21.952Z",
			"average_rating": 4000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 816572760,
			"report_score": 12000,
			"cover_url": "https://learning.oreilly.com/library/cover/9780132918961/",
			"date_added": "2019-09-02T17:48:11.059Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781787125384/",
			"archive_id": "9781787125384",
			"ourn": "urn:orm:book:9781787125384",
			"isbn": "9781787125384",
			"last_modified_time": "2021-05-11T18:23:30.480Z",
			"issued": "2018-02-28T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"V.N. Nikhil Anurag"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Distributed Computing with Go",
			"description": "<span><p><b>A tutorial leading the aspiring Go developer to full mastery of Golang's distributed features.</b></p><p><b>About This Book</b></p><ul><li>This book provides enough concurrency theory to give you a contextual understanding of Go concurrency</li><li>It gives weight to synchronous and asynchronous data streams in Golang web applications</li><li>It makes Goroutines and Channels completely familiar and natural to Go developers</li></ul><p><b>Who This Book Is For</b></p><p>This book is for developers who are familiar with the Golang syntax and have a good idea of how basic Go development works. It would be advantageous if you have been through a web application product cycle, although it's not necessary.</p><p><b>What You Will Learn</b></p><ul><li>Gain proficiency with concurrency and parallelism in Go</li><li>Learn how to test your application using Go's standard library</li><li>Learn industry best practices with technologies such as REST, OpenAPI, Docker, and so on</li><li>Design and build a distributed search engine</li><li>Learn strategies on how to design a system for web scale</li></ul><p><b>In Detail</b></p><p>Distributed Computing with Go gives developers with a good idea how basic Go development works the tools to fulfill the true potential of Golang development in a world of concurrent web and cloud applications. Nikhil starts out by setting up a professional Go development environment. Then you'll learn the basic concepts and practices of Golang concurrent and parallel development. </p><p>You'll find out in the new few chapters how to balance resources and data with REST and standard web approaches while keeping concurrency in mind.  Most Go applications these days will run in a data center or on the cloud, which is a condition upon which the next chapter depends. There, you'll expand your skills considerably by writing a distributed document indexing system during the next two chapters. This system has to balance a large corpus of documents with considerable analytical demands. </p><p>Another use case is the way in which a web application written in Go can be consciously redesigned to take distributed features into account. The chapter is rather interesting for Go developers who have to migrate existing Go applications to computationally and memory-intensive environments. The final chapter relates to the rather onerous task of testing parallel and distributed applications, something that is not usually taught in standard computer science curricula.</p><p><b>Style and approach</b></p><p>Distributed Computing with Go takes you through a series of carefully graded tutorials, building ever more sophisticated applications.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781787125384/",
			"web_url": "/library/view/distributed-computing-with/9781787125384/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 316,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T03:22:59.541Z",
			"average_rating": 3000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 808667622,
			"report_score": 3000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781787125384/",
			"date_added": "2019-08-30T02:59:01.878Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781491982310/",
			"archive_id": "9781491982310",
			"ourn": "urn:orm:book:9781491982310",
			"isbn": "9781491982303",
			"last_modified_time": "2021-05-11T22:57:03.210Z",
			"issued": "2017-04-15T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Liz Rice"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "How to Containerize Your Go Code",
			"description": "<span><span><span><div><p>This report shows how Go programmers can build small, efficient containers for their Go code. It explains what's inside a container image and walks you through how to build and run containers for your Go projects.</p><p><b>What you'll learn—and how you can apply it</b></p><p>You'll learn how to containerize the Go code you're working on, with worked examples to show you exactly what to do. You'll see how to build a container from the scratch image, and why that's a good idea for Go code. You'll also learn how to set up port bindings so that the outside work can connect to the code running in your container, and how to pass in configuration environment variables.</p><p><b>This report is for you because…</b></p><ul><li>You've heard of containers, but you're not sure whether they're right for your project, or how you would use them in your daily workflow.</li></ul><p><b>Prerequisites</b></p><ul><li>We'll assume you're comfortable with the command line</li><li>We're using Go in this lesson but many of the concepts are applicable to other languages as well</li></ul><p><b>Materials or downloads needed in advance</b></p><ul><li>Install <a href=\"https://www.docker.com/products/overview\">Docker</a></li><li>Install the <a href=\"https://golang.org/doc/install\">Go</a> tools</li></ul></div></span></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781491982310/",
			"web_url": "/library/view/how-to-containerize/9781491982310/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 23,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-26T16:04:13.042Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 2,
			"popularity": 790674681,
			"report_score": 10000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781491982310/",
			"date_added": "2019-08-30T09:12:41.523Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781783988020/",
			"archive_id": "9781783988020",
			"ourn": "urn:orm:book:9781783988020",
			"isbn": "9781783988020",
			"last_modified_time": "2021-05-11T19:09:51.183Z",
			"issued": "2015-01-23T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mat Ryer"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Programming Blueprints",
			"description": "<span><p><b>Build real-world, production-ready solutions in Go using cutting-edge technology and techniques</b></p><p><b>In Detail</b></p><p>Dive headfirst into solving actual enterprise problems and start cutting code from the word go. You will build complete applications around a variety of subjects using a range of different technologies and techniques, all of which are directly applicable to today's tech start-up world.</p><p>Scale, performance, and high availability lie at the heart of the projects, and the lessons learned throughout this book will arm you with everything you need to build world-class solutions. Well-designed applications and sensible architectures can scale horizontally to cope with the demands of up to millions of users, while avoiding the prohibitive up-front investment that can bring a project to its knees.</p><p><b>What You Will Learn</b></p><ul><li>Build quirky and fun projects from scratch while exploring widely applicable skills, patterns, practices, and techniques, as well as a range of different technologies</li><li>Create websites and data services capable of massive scale using Go's net/http package, exploring RESTful patterns as well as low-latency WebSocket APIs</li><li>Interact with a variety of remote web services to consume capabilities ranging from authentication and authorization to a fully functioning thesaurus</li><li>Develop high-quality command-line tools that utilize the powerful shell capabilities and have great performance using Go's in-built concurrency mechanisms</li><li>Implement a modern document database as well as high-throughput messaging queue technology to put together an architecture that is truly ready for scale</li><li>Write concurrent programs and gracefully manage their execution and communication with smart use of channels</li></ul></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781783988020/",
			"web_url": "/library/view/go-programming-blueprints/9781783988020/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 309,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T03:51:05.308Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 787759447,
			"report_score": 5000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781783988020/",
			"date_added": "2019-08-31T02:07:53.355Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788623926/",
			"archive_id": "9781788623926",
			"ourn": "urn:orm:book:9781788623926",
			"isbn": "9781788623926",
			"last_modified_time": "2022-03-10T04:31:03.593Z",
			"issued": "2018-03-29T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Jan Hohenheim",
				"Daniel Durante"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Rust Standard Library Cookbook",
			"description": "<span><p><b>Explore the Rust Standard library and compose algorithms with minimal dependency on external libraries</b></p><h4>Key Features</h4><ul><li>Develop high-quality, fast, and portable applications by leveraging the power of Rust's Standard library.</li><li>Practical recipes that will help you work with the Standard library to boost your productivity as a Rust developer.</li><li>Learn about most relevant external crates to be used along with the Standard library.</li></ul><h4>Book Description</h4><p>Mozilla's Rust is gaining much attention with amazing features and a powerful library. This book will take you through varied recipes to teach you how to leverage the Standard library to implement efficient solutions.</p><p>The book begins with a brief look at the basic modules of the Standard library and collections. From here, the recipes will cover packages that support file/directory handling and interaction through parsing. You will learn about packages related to advanced data structures, error handling, and networking. You will also learn to work with futures and experimental nightly features. The book also covers the most relevant external crates in Rust. </p><p>By the end of the book, you will be proficient at using the Rust Standard library.</p><h4>What you will learn</h4><ul><li>How to use the basic modules of the library: strings, command line access, and more.</li><li>Implement collections and folding of collections using vectors, Deque, linked lists, and more.</li><li>Handle various file types, compressing, and decompressing data.</li><li>Search for files with glob patterns.</li><li>Implement parsing through various formats such as CSV, TOML, and JSON.</li><li>Utilize drop trait, the Rust version of destructor.</li><li>Resource locking with Bilocks.</li></ul><h4>Who this book is for</h4><p>This book is for developers who would like to explore the power of Rust and learn to use the STL for various functionalities. A basic Rust programming knowledge is assumed.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781788623926/",
			"web_url": "/library/view/rust-standard-library/9781788623926/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 365,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-03-10T04:35:28.088Z",
			"average_rating": 3000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 717461306,
			"report_score": 3000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788623926/",
			"date_added": "2022-03-10T04:30:31.042Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781492033172/",
			"archive_id": "9781492033172",
			"ourn": "urn:orm:book:9781492033172",
			"isbn": "9781492033189",
			"last_modified_time": "2021-05-11T22:41:08.340Z",
			"issued": "2018-06-15T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Luciano Ramalho"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Python vs. Go",
			"description": "<span><p>Comparing Python with Go is a bit like comparing an SUV with a sports car: they were created to serve different needs. Thanks to their simple syntax and careful design, you will probably find Python and Go easier to learn and use than other mainstream languages that you might have already studied. Given their gentle learning curve and phenomenal growth in several fields, getting to know them is a sound investment now.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781492033172/",
			"web_url": "/library/view/python-vs-go/9781492033172/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 20,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:11:33.651Z",
			"average_rating": 4167,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 6,
			"popularity": 698261239,
			"report_score": 25000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781492033172/",
			"date_added": "2019-08-29T23:53:58.023Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781457192845/",
			"archive_id": "9781457192845",
			"ourn": "urn:orm:book:9781457192845",
			"isbn": "9780992461294",
			"last_modified_time": "2021-05-11T22:39:51.006Z",
			"issued": "2015-04-27T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Mal Curtis"
			],
			"publishers": [
				"SitePoint"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Level Up Your Web Apps With Go",
			"description": "<span><span><span><div><p>Go is an open-source language from Google that's a bit like C. Designed for programmer productivity, it's got a clean syntax, and emphasizes concurrency.</p><p>This book gives you all you need to use Go in your web applications. You'll learn the basic concepts - language structures, the standard library, and Go tools - then tackle more advanced features like concurrency concepts, testing methodologies, and package structures.</p><p>At each step, you'll get advice for better coding in Go. You'll see how to structure projects, how to use concurrency effectively, and best practices for testing - as well as many valuable hints and tips gleaned from real world experience of developing web applications with Go.</p><p>You'll learn:</p><ul><li>Get to grips with Go language basics (types, the standard library, tools)</li><li>Use Go with HTTP</li><li>Work with images</li><li>Understand concurrency</li><li>Test effectively</li><li>Master deployment</li><li>And much more ...</li></ul></div></span></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781457192845/",
			"web_url": "/library/view/level-up-your/9781457192845/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 276,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T22:03:55.906Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 3,
			"popularity": 676077350,
			"report_score": 15000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781457192845/",
			"date_added": "2019-08-30T21:19:45.952Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781788394185/",
			"archive_id": "9781788394185",
			"ourn": "urn:orm:book:9781788394185",
			"isbn": "9781788394185",
			"last_modified_time": "2021-05-11T22:18:33.715Z",
			"issued": "2017-12-29T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Kamesh Balasubramanian"
			],
			"publishers": [
				"Packt Publishing"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Isomorphic Go",
			"description": "<span><p><b>Learning about isomorphic development in Go leads to a unified view of web and back-end development: It extends the remit of a server-side programming language to the browser.</b></p><p><b>About This Book</b></p><ul><li>Learn how to build Isomorphic Go web applications</li><li>Neatly organize your isomorphic codebase to enhance the maintainability of your application</li><li>Leverage the same Go code across the web server and the web browser</li></ul><p><b>Who This Book Is For</b></p><p>This book addresses web developers, who are comfortable with JavaScript and the full web development cycle. You may or may not be experienced in isomorphic development, but should have a basic understanding of Go's syntax.</p><p><b>What You Will Learn</b></p><ul><li>Create Go programs inside the web browser using GopherJS</li><li>Render isomorphic templates on both the client side and the server side</li><li>Perform end-to-end application routing for greater search engine discoverability and an enhanced user experience</li><li>Implement isomorphic handoff to seamlessly transition state between the web server and the web browser</li><li>Build real-time web application functionality with websockets</li><li>Create reusable components (cogs) that are rendered using the virtual DOM</li><li>Deploy an Isomorphic Go application for production use</li></ul><p><b>In Detail</b></p><p>Isomorphic Go is the methodology to create isomorphic web applications using the Go programming language. Isomorphic web applications have the capability to reuse code across environments, increasing the synergy between the web server and the web browser. This book is a hands-on guide that will show you how to build and deploy an Isomorphic Go web application.</p><p>Isomorphic Go begins with an in-depth exploration of the benefits provided by the isomorphic web application architecture. You'll be introduced to the Isomorphic Go toolchain, and how it can help you write Go code that functions across environments. You'll learn how to create Go programs in the web browser using GopherJS and how to render isomorphic templates. Then you'll be introduced to end-to-end application routing, use isomorphic handoff to seamlessly transition state from the web server to the web browser, and compose isomorphic forms that have the ability to reuse form validation logic. You'll be exposed to advanced concepts including the implementation of real-time web application functionality with websockets and the creation of reusable components (cogs) that are rendered using the virtual DOM. Finally, you'll see how to deploy an Isomorphic Go web application to a production environment.</p><p><b>Style and Approach</b></p><p>Kamesh guides beginner Go developers and JavaScript developers with basic Go syntax skills through a full Go tutorial until they emerge with a working knowledge of isomorphic Go development.</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781788394185/",
			"web_url": "/library/view/isomorphic-go/9781788394185/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 647,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-25T22:27:57.052Z",
			"average_rating": 5000,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 615103435,
			"report_score": 5000,
			"cover_url": "https://learning.oreilly.com/library/cover/9781788394185/",
			"date_added": "2019-08-30T04:07:35.226Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781119745549/",
			"archive_id": "9781119745549",
			"ourn": "urn:orm:book:9781119745549",
			"isbn": "9781119745549",
			"last_modified_time": "2022-01-24T23:47:02.760Z",
			"issued": "2021-01-07T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Kelly Bagla"
			],
			"publishers": [
				"Wiley"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Go Legal Yourself!, 2nd Edition",
			"description": "<span><p><b>Avoid legal pitfalls for your business from day one</b> </p><p>A common characteristic of entrepreneurs is the attitude: “I’m not going to do that until I <i>absolutely</i> have to.” And it’s understandable why: with limited time and resources it seems logical to focus on tasks like product development, production, marketing, and delivery—the ones that get your product or service out into the marketplace. The last thing you want to do is spend money and effort on legal issues, which is why they often drop to the bottom of the pile. But this can be a costly mistake—and <i>Go Legal Yourself</i> is here to make sure it’s one you avoid.  </p><p>Attorney, inventor, and businesswoman—named Top Woman Entrepreneur by <i>LA Dreams Magazine</i> in 2017—Kelly Bagla knows about doing business from both the entrepreneurial and legal sides of the fence. And in <i>Go Legal Yourself,</i> she guides you through the four key legal lifecycle phases every business experiences—and sets you up for worry-free success from day one. Establish yourself as the correct legal entity </p><ul style=\"margin-bottom: 0in; font-size: medium; margin-top: 0in; user-select: text; -webkit-user-drag: none; -webkit-tap-highlight-color: transparent; cursor: text; overflow: visible;\" type=\"disc\"><li style=\"margin: 0in 0in 0.0001pt 0.25in; font-size: 11pt; font-family: Calibri, sans-serif; vertical-align: baseline; user-select: text; -webkit-user-drag: none; -webkit-tap-highlight-color: transparent; cursor: text; overflow: visible;\">Gather and complete the relevant documentation  </li><li style=\"margin: 0in 0in 0.0001pt 0.25in; font-size: 11pt; font-family: Calibri, sans-serif; vertical-align: baseline; user-select: text; -webkit-user-drag: none; -webkit-tap-highlight-color: transparent; cursor: text; overflow: visible;\">Protect your brand  </li><li style=\"margin: 0in 0in 0.0001pt 0.25in; font-size: 11pt; font-family: Calibri, sans-serif; vertical-align: baseline; user-select: text; -webkit-user-drag: none; -webkit-tap-highlight-color: transparent; cursor: text; overflow: visible;\">Identify and avoid common (and expensive) pitfalls </li><li style=\"margin: 0in 0in 0.0001pt 0.25in; font-size: 11pt; font-family: Calibri, sans-serif; vertical-align: baseline; user-select: text; -webkit-user-drag: none; -webkit-tap-highlight-color: transparent; cursor: text; overflow: visible;\">Plan and manage growth, enter new markets, and keep a sharp competitive edge </li></ul><p>Wherever you are with your business, this book is your guarantee you have all your legal ducks in a row—and that no nasty legal surprises stand between you and your target: success.  </p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781119745549/",
			"web_url": "/library/view/go-legal-yourself/9781119745549/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 241,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-01-24T23:48:08.214Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 611247813,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781119745549/",
			"date_added": "2022-01-24T23:46:27.296Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780080949697/",
			"archive_id": "9780080949697",
			"ourn": "urn:orm:book:9780080949697",
			"isbn": "9781856175319",
			"last_modified_time": "2021-03-01T21:55:49.599Z",
			"issued": "2009-06-17T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Trevor Kletz"
			],
			"publishers": [
				"Elsevier Science"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "What Went Wrong?",
			"description": "<span><p>\"What Went Wrong?\" has revolutionized the way industry views safety. <br/><br/>The new edition continues and extends the wisdom, innovations and strategies of previous editions, by introducing new material on recent incidents, and adding an extensive new section that shows how many accidents occur through simple miscommunications within the organization, and how strightforward changes in design can often remove or reduce opportunities for human errors. <br/><br/>Kletz' approach to learning as deeply as possible from previous experiences is made yet more valuable in this new edtion, which for the first time brings together the approaches and cases of \"What Went Wrong\" with the managerially focussed material previously published in \"Still Going Wrong\". Updated and supplemented with new cases and analysis, this fifth edition is the ultimate resource of experienced based anaylsis and guidance for the safety and loss prevention professionals.  <br/><br/><br/><br/><br/><br/>* A million dollar bestseller, this trusted book is updated with new material, including the Texas City and Buncefield incidents, and supplemented by material from Trevor Kletz's 'Still Going Wrong'<br/>* Now presents a complete analysis of the design, operational and for the first time, managerial causes of process plant accidents and disasters, plus their aftermaths<br/>* Case histories illustrate what went wrong, why it went wrong, and then guide readers in how to avoid similar tragedies: learn from the mistakes of others</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780080949697/",
			"web_url": "/library/view/what-went-wrong/9780080949697/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 1098,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T23:52:43.139Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 548729625,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9780080949697/",
			"date_added": "2021-03-01T21:52:32.937Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781492031512/",
			"archive_id": "9781492031512",
			"ourn": "urn:orm:book:9781492031512",
			"isbn": "9781492031505",
			"last_modified_time": "2021-05-11T18:30:41.239Z",
			"issued": "2018-01-18T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Liz Rice"
			],
			"publishers": [
				"O'Reilly Media, Inc."
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Should You Containerize Your Go Code?",
			"description": "<span><div><p>Docker’s catchphrase for its containers is compelling: \"Build, Ship and Run Any App, Anywhere.\" Go already has some of those attributes built in, including cross-compilation and the production of single executable files without dependencies. Are there any reasons, then, for Go programmers to use containers to deploy code?</p><p>In this lesson, veteran developer Liz Rice outlines several advantages that containers can provide for Go programmers—such as how they help you restrict the resources that your code can access, and how you can use them to run and test your software locally with other components. You’ll then look at some cases where containers wouldn’t add any benefit at all.</p><p>As always, it’s important to use the right tool for the job, and containers can offer advantages for Go programmers in the right circumstances. This lesson provides some helpful guidelines.</p></div></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781492031512/",
			"web_url": "/library/view/should-you-containerize/9781492031512/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 11,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-28T00:13:16.424Z",
			"average_rating": 3500,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 1,
			"popularity": 483332240,
			"report_score": 3500,
			"cover_url": "https://learning.oreilly.com/library/cover/9781492031512/",
			"date_added": "2019-08-30T03:52:22.612Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9780203491324/",
			"archive_id": "9780203491324",
			"ourn": "urn:orm:book:9780203491324",
			"isbn": "9781135505905",
			"last_modified_time": "2022-04-19T23:12:21.969Z",
			"issued": "2017-09-11T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"Charles W. Kann"
			],
			"publishers": [
				"Auerbach Publications"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "Creating Components",
			"description": "<span><p>Concurrency is a powerful technique for developing efficient and lightning- fast software. For instance, concurrency can be used in common applications such as online order processing to speed processing and ensure transaction reliability. However, mastering concurrency is one of the greatest challenges for both new and veteran programmers. Softwar</p></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9780203491324/",
			"web_url": "/library/view/creating-components/9780203491324/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 585,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2022-04-19T23:12:34.042Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 453102592,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9780203491324/",
			"date_added": "2019-11-07T15:47:59.780Z",
			"topics": [
				"48e22a8f-d8f8-4bdc-9760-6437bb1c9c04"
			],
			"topics_payload": [
				{
					"uuid": "48e22a8f-d8f8-4bdc-9760-6437bb1c9c04",
					"slug": "concurrency",
					"name": "Concurrency",
					"score": null
				}
			]
		},
		{
			"id": "https://www.safaribooksonline.com/api/v1/book/9781430261360/",
			"archive_id": "9781430261360",
			"ourn": "urn:orm:book:9781430261360",
			"isbn": "9781430261360",
			"last_modified_time": "2021-05-11T19:19:27.039Z",
			"issued": "2013-06-03T00:00:00Z",
			"format": "book",
			"content_format": "book",
			"authors": [
				"R Nigel Horspool",
				"Nikolai Tillmann"
			],
			"publishers": [
				"Apress"
			],
			"academic_excluded": false,
			"language": "en",
			"title": "TouchDevelop: Programming on the Go, Third Edition",
			"description": "<span><span><p>\"The book is great! It's clear and easy to read, with loads of examples that showed my students what to do.\"</p><p>-- Larry Snyder, Emeritus Professor, University of Washington, Department of Computer Science and Engineering</p><p>\"Having the TouchDevelop book available made our events so much easier. Students could figure things out for themselves with help from the book.\"</p><p>-- Jennifer Marsman, Microsoft Principal Developer Evangelist</p><p>Mobiledevices such as smartphones and tablets are set to become the main computersthat virtually all people will own and carry with them at all times. And yet,mobile devices are not yet used for all computing tasks. A project at MicrosoftResearch was created to answer a simple question: \"It is possible to createinteresting apps directly on a smartphone or tablet, without using a separatePC or a keyboard?\" The result is TouchDevelop, a programming environment thatruns on all modern mobile devices such as Windows Phone, iPhone, iPad, Androidphones and tablets, and also on PCs and Macs.</p><p>This book walks you through all of the screens of the TouchDevelop app, and itpoints out similarities and differences of the TouchDevelop language comparedto other programming languages. For users, the book can serve as a handyreference next to the phone. The book systematically addresses all programminglanguage constructs, starting from the very basic constructs such as variablesand loops. The book also explores many of the phone sensors and data sourceswhich make creating apps for mobile devices so rewarding.</p><p>If you are new to programming with TouchDevelop, or if you have not yet workedon touchscreen devices, we suggest that you read the book starting from Chapter1. If you are already familiar with the basic paradigm of the TouchDevelopprogramming environment, then feel free to jump ahead to the later chaptersthat address particular topic areas.</p><p>This book is written from theperspective of a person developing their code using a web browser. TheTouchDevelop Web App runs in many modern browsers on many different devicesincluding smartphones and tablets, Macs, PC. All screenshots and navigationinstructions refer to the TouchDevelop Web App running in a browser. ForWindows Phone, there is a dedicated TouchDevelop app in the Windows Phone Storewhich gives access to many more sensors and data sources. Starting with theTouchDevelop app v3.0 for Windows Phone 8, the phone app will share the samelook and navigation structure and all features of the Web App.</p><p><b>What you'll learn</b></p><li><p>The little tricks to programming on your mobile devices and for a mobile device</p></li><li><p>The scripting language and cloud-based ecosystem</p></li><li><p>Using cameras, video and audio, and other sensors such as a microphone, accelerometer, compass, and gyroscope</p></li><li><p>Access to the web, authorized access to web services</p></li><li><p>How to write simple games using a built-in physics engine</p></li><p><b>Who this book is for</b></p><p>This programming language was written for people who wish tobe able to create apps from their phone. This scenario is particularlyappealing to enthusiastic end-users who own mobile devices and students, whoare the target audience of this book.</p></span></span>",
			"url": "https://learning.oreilly.com/api/v1/book/9781430261360/",
			"web_url": "/library/view/touchdevelop-programming-on/9781430261360/",
			"source": "application/epub+zip",
			"content_type": "book",
			"virtual_pages": 287,
			"duration_seconds": -1,
			"has_assessment": false,
			"timestamp": "2021-10-27T05:31:22.744Z",
			"average_rating": 0,
			"number_of_followers": 0,
			"number_of_items": 0,
			"number_of_reviews": 0,
			"popularity": 399237065,
			"report_score": 0,
			"cover_url": "https://learning.oreilly.com/library/cover/9781430261360/",
			"date_added": "2019-09-01T12:22:14.290Z",
			"topics": [
				"1f9a175c-a561-4931-9361-b34d44a2b8ec"
			],
			"topics_payload": [
				{
					"uuid": "1f9a175c-a561-4931-9361-b34d44a2b8ec",
					"slug": "go",
					"name": "Go",
					"score": null
				}
			]
		}
	],
	"facets": {},
	"total": 64,
	"meta": {
		"query_identifier": "a9919a72-a082-49f6-929d-d72f85175348"
	},
	"page": 0,
	"previous": null,
	"next": null
}
